# CAO Points

In [239]:
# For dataframes
import pandas as pd

# Numerical arrays
import numpy as np

# For HTTP requests
import requests as rq

# For regular expressions
import re

# For accessing dates and times
import datetime as dt

# Accessing and downloading using urls
import urllib.request as urlrq

# For reading pdfs 
import tabula

# Plotting
import matplotlib as plt
import seaborn as sns

### Datetime

In [2]:
"""Using datetime to create a variable that will refer to a string stating the current time.
This will be used throughout this notebook to save files with the current time in the filename."""

# Access the current date and time.
now = dt.datetime.now()

# Formatting the current date and time as a string and saving to a variable.
current_time = now.strftime('%Y%m%d_%H%M%S')

In [3]:
# Make dataframe scrollable to eyeball any obvious errors in dataframes
# Commenting out for now as it's slowing down the browser too much
# pd.set_option("display.max_rows", None)

### Functions

In [4]:
# A function that adds courses with specific symbols in the points columns to lists
# Then returns the points without the symbols
# * - Not all on this points score were offered places
# # - Test / Interview / Portfolio / Audition
# AQA - All qualified applicants
# Commented out for now until it's tested fully
"""
def points_to_array(s):
    portfolio = ''
    if s[0] == '#':
        portfolio = '#'
    random = ''
    if s[-1] == '*':
        random = '*'
    aqa = ''
    if s == 'AQA':
        aqa = 'AQA'
    points = ''
    for i in s:
        if i.isdigit():
            points = points + i
    return[points, portfolio, random, aqa]
"""

"\ndef points_to_array(s):\n    portfolio = ''\n    if s[0] == '#':\n        portfolio = '#'\n    random = ''\n    if s[-1] == '*':\n        random = '*'\n    aqa = ''\n    if s == 'AQA':\n        aqa = 'AQA'\n    points = ''\n    for i in s:\n        if i.isdigit():\n            points = points + i\n    return[points, portfolio, random, aqa]\n"

In [5]:
# A function that finds courses that required Test / Interview / Portfolio / Audition
# As indicated by the '#' character
def portfolio(df):
    # Find '#' in pointsR1 column
    df_portfolio1 = df[df['pointsR1'].str.match("#", na=False)]
    # find '#' in pointsR2 column
    df_portfolio2 = df[df['pointsR2'].str.match("#", na=False)]
    # Concat the dataframes together
    df_portfolio = pd.concat([df_portfolio1, df_portfolio2], ignore_index=True)
    # Remove duplicates
    df_portfolio = df_portfolio.drop_duplicates()
    return df_portfolio

In [6]:
# A function that finds courses where all on this points score were offered places
# As indicated by the '*' character
def random(df):
    # Find '*' in pointsR1 column
    df_random1 = df[df['pointsR1'].str[-1] == '*']
    # find '#' in pointsR2 column
    df_random2 = df[df['pointsR2'].str[-1] == '*']
    # Concat the dataframes together
    df_random = pd.concat([df_random1, df_random2], ignore_index=True)
    # Remove duplicates
    df_random = df_random.drop_duplicates()
    return df_random

In [7]:
# A function that finds courses where all qualified applicants earned places
# As indicated by AQA
def aqa(df):
    # Find 'AQA' in pointsR1 column
    df_aqa1 = df[df['pointsR1'].str.match("AQA", na=False)]
    # find 'AQA' in pointsR2 column
    df_aqa2 = df[df['pointsR2'].str.match("AQA", na=False)]
    # Concat the dataframes together
    df_aqa = pd.concat([df_aqa1, df_aqa2], ignore_index=True)
    # Remove duplicates
    df_aqa = df_aqa.drop_duplicates()
    return df_aqa

In [8]:
# A function that finds courses where there's new competition for available places
# As indicated by the 'v' character
def comp(df):
    # Find 'v' in pointsR1 column
    df_comp1 = df[df['pointsR1'].str[-1] == 'v']
    # find '#' in pointsR2 column
    df_comp2 = df[df['pointsR2'].str[-1] == 'v']
    # Concat the dataframes together
    df_comp = pd.concat([df_comp1, df_comp2], ignore_index=True)
    # Remove duplicates
    df_comp = df_comp.drop_duplicates()
    return df_comp

In [9]:
# Add new columns with point totals sans additional characters
# https://stackoverflow.com/questions/13682044/remove-unwanted-parts-from-strings-in-a-column/22238380
def points(df):
    df2 = df.assign(Round_1_Points=df['pointsR1'].str.replace(r'\D', '', regex=True))
    df3 = df2.assign(Round_2_Points=df['pointsR2'].str.replace(r'\D', '', regex=True))
    return df3

## 2021 Level 8 Points

In [10]:
resp2021_l8 = rq.get('http://www2.cao.ie/points/l8.php')

In [11]:
resp2021_l8

In [12]:
"""Have to change the encoding as the following error is returned:
'charmap' codec can't encode character '\x96' in position 25767: character maps to <undefined>"""

# The server uses the wrong encoding.
original_encoding = resp2021_l8.encoding

# Change to cp1252, which recognises the '\x96' character.
resp2021_l8.encoding = 'cp1252'

In [13]:
# Create a file path for the original data.
path2021_l8_html = 'cao-data/2021-points/2021-level-8-points/cao2021_level8_' + current_time + '.html'

In [14]:
# Save the original html file.
with open(path2021_l8_html, 'w') as f:
    f.write(resp2021_l8.text)

In [15]:
# re adapted from:https://github.com/ianmcloughlin/cao-points/blob/main/cao-points-analysis.ipynb

# Using regular expression to extract the lines of data we want.
re_course = re.compile(r'([A-Z]{2}[0-9]{3})(.*)')

In [16]:
# Code adapted from: https://github.com/ianmcloughlin/cao-points/blob/main/cao-points-analysis.ipynb


# The file path for the csv file.
path2021_l8 = 'cao-data/2021-points/2021-level-8-points/cao2021_level8_csv_' + current_time + '.csv'

# Keep track of how many courses we process.
no_lines = 0

# Open the csv file for writing.
with open(path2021_l8, 'w') as f:
    # Write a header row.
    f.write(','.join(['code', 'title', 'pointsR1', 'pointsR2']) + '\n')
    # Loop through lines of the response.
    for line in resp2021_l8.iter_lines():
        # Decode the line, using the wrong encoding!
        dline = line.decode('cp1252')
        # Match only the lines representing courses.
        if re_course.fullmatch(dline):
            # Add one to the lines counter.
            no_lines = no_lines + 1
            # The course code.
            course_code = dline[:5]
            # The course title.
            course_title = dline[7:57].strip()
            # Round one points.
            course_points = re.split(' +', dline[60:])
            if len(course_points) != 2:
                course_points = course_points[:2]
            # Join the fields using a comma.
            linesplit = [course_code, course_title, course_points[0], course_points[1]]
            # Rejoin the substrings with commas in between.
            f.write(','.join(linesplit) + '\n')

# Print the total number of processed lines.
print(f"Total number of lines is {no_lines}.")

Total number of lines is 949.

In [17]:
# Load the 2021 level 8 data to a pandas dataframe
df2021_l8 = pd.read_csv(path2021_l8, encoding='cp1252')

In [18]:
# Extracting all Portfolio/Test/Interview/Audition courses 
df2021_l8_portfolio = portfolio(df2021_l8)

In [19]:
df2021_l8_portfolio

     code                                              title pointsR1 pointsR2
0   AL861             Animation and Illustration (portfolio)     #575      NaN
1   AL863             Graphic and Digital Design (portfolio)     #747      NaN
2   CW038                                    Art (portfolio)     #700      NaN
3   CW858  Sports Management and Coaching (options  portf...     #700      NaN
4   CR121                  Music at CIT Cork School of Music     #904     #904
..    ...                                                ...      ...      ...
78  SG244                                           Fine Art     #501      NaN
79  TL801  Animation  Visual Effects and Motion Design (L...     #718      NaN
80  WD027                                              Music     #321      NaN
96  MH802   Community and Youth Work (part-time  in service)      NaN        #
97  MH803  Local Studies/Community Studies (part-time  ev...      NaN        #

[83 rows x 4 columns]

In [20]:
# Extracting courses where not everyone with those points were offered places
df2021_l8_random = random(df2021_l8)

In [21]:
df2021_l8_random

,code,title,pointsR1,pointsR2
0,AL830,General Nursing,451*,444
1,AL832,Mental Health Nursing,440*,431
2,AL870,Applied Psychology,484*,467*
3,CR320,Biomedical Science - Offered jointly by CIT an...,590*,NaN
4,CR930,Home Economics and Business,518*,NaN
...,...,...,...,...
118,DN600,Law (options),576,567*
119,DN660,Commerce International (options),555,554*
120,DN710,Economics,534,532*
123,LM090,Physical Education with concurrent Teacher Edu...,552,544*
124,AS002,Education Home Economics and Religious Ed - with,464,452*

In [22]:
# Extracting courses where all qualified applicants earned places
df2021_l8_aqa = aqa(df2021_l8)

In [23]:
df2021_l8_aqa

    code                                              title pointsR1 pointsR2
0  MH801  Early Childhood - Teaching and Learning (part-...      AQA      AQA

In [24]:
# Add extra columns for points only using previously defined function
df2021_l8 = points(df2021_l8)

In [25]:
df2021_l8

,code,title,pointsR1,pointsR2,Round_1_Points,Round_2_Points
0,AL801,Software Design for Virtual Reality and Gaming,300,NaN,300,NaN
1,AL802,Software Design in Artificial Intelligence for...,313,NaN,313,NaN
2,AL803,Software Design for Mobile Apps and Connected ...,350,NaN,350,NaN
3,AL805,Computer Engineering for Network Infrastructure,321,NaN,321,NaN
4,AL810,Quantity Surveying,328,NaN,328,NaN
...,...,...,...,...,...,...
944,WD211,Creative Computing,270,NaN,270,NaN
945,WD212,Recreation and Sport Management,262,NaN,262,NaN
946,WD230,Mechanical and Manufacturing Engineering,230,230,230,230
947,WD231,Early Childhood Care and Education,266,NaN,266,NaN
948,WD232,Business Information Systems,261,261,261,261

In [26]:
# Rename columns to match later dataframes
df2021_l8.rename(columns={'code': 'Course Code', 'title': 'INSTITUTION and COURSE'}, inplace=True)

In [27]:
df2021_l8

,Course Code,INSTITUTION and COURSE,pointsR1,pointsR2,Round_1_Points,Round_2_Points
0,AL801,Software Design for Virtual Reality and Gaming,300,NaN,300,NaN
1,AL802,Software Design in Artificial Intelligence for...,313,NaN,313,NaN
2,AL803,Software Design for Mobile Apps and Connected ...,350,NaN,350,NaN
3,AL805,Computer Engineering for Network Infrastructure,321,NaN,321,NaN
4,AL810,Quantity Surveying,328,NaN,328,NaN
...,...,...,...,...,...,...
944,WD211,Creative Computing,270,NaN,270,NaN
945,WD212,Recreation and Sport Management,262,NaN,262,NaN
946,WD230,Mechanical and Manufacturing Engineering,230,230,230,230
947,WD231,Early Childhood Care and Education,266,NaN,266,NaN
948,WD232,Business Information Systems,261,261,261,261

In [28]:
# Save pandas dataframe to disk.
df2021_l8.to_csv(path2021_l8)

## 2021 Level 7/6 Points

In [29]:
resp2021_l76 = rq.get('http://www2.cao.ie/points/l76.php')

In [30]:
resp2021_l76

In [31]:
# Create a file path for the original data.
path2021_l76_html = 'cao-data/2021-points/2021-level-7-and-6-points/cao2021_level7_6_' + current_time + '.html'

In [32]:
# Save the original html file.
with open(path2021_l76_html, 'w') as f:
    f.write(resp2021_l76.text)

In [33]:
# The file path for the csv file.
path2021_l76 = 'cao-data/2021-points/2021-level-7-and-6-points/cao2021_level7_6_csv_' + current_time + '.csv'

# Keep track of how many courses we process.
no_lines = 0

# Open the csv file for writing.
with open(path2021_l76, 'w') as f:
    # Write a header row.
    f.write(','.join(['code', 'title', 'pointsR1', 'pointsR2']) + '\n')
    # Loop through lines of the response.
    for line in resp2021_l76.iter_lines():
        # Decode the line, using the wrong encoding!
        dline = line.decode('cp1252')
        # Match only the lines representing courses.
        if re_course.fullmatch(dline):
            # Add one to the lines counter.
            no_lines = no_lines + 1
            # The course code.
            course_code = dline[:5]
            # The course title.
            course_title = dline[7:57].strip()
            # Round one points.
            course_points = re.split(' +', dline[60:])
            if len(course_points) != 2:
                course_points = course_points[:2]
            # Join the fields using a comma.
            linesplit = [course_code, course_title, course_points[0], course_points[1]]
            # Rejoin the substrings with commas in between.
            f.write(','.join(linesplit) + '\n')

# Print the total number of processed lines.
print(f"Total number of lines is {no_lines}.")

Total number of lines is 416.

In [34]:
# Load the 2021 level 7 and level 6 data to a pandas dataframe
df2021_l76 = pd.read_csv(path2021_l76, encoding='cp1252')

In [35]:
df2021_l76

      code                                             title pointsR1 pointsR2
0    AL605                   Music and Instrument Technology      211      NaN
1    AL630                               Pharmacy Technician      308      NaN
2    AL631                                    Dental Nursing      311      NaN
3    AL632                                   Applied Science      297      NaN
4    AL650                                          Business      AQA      AQA
..     ...                                               ...      ...      ...
411  WD188                               Applied Health Care      220      NaN
412  WD205  Molecular Biology with Biopharmaceutical Science      AQA     262v
413  WD206                            Electronic Engineering      180      NaN
414  WD207                            Mechanical Engineering      172      NaN
415  WD208                         Manufacturing Engineering      317      NaN

[416 rows x 4 columns]

In [36]:
# Extracting all Portfolio/Test/Interview/Audition courses 
df2021_l76_portfolio = portfolio(df2021_l76)

In [37]:
df2021_l76_portfolio

     code                                              title pointsR1 pointsR2
0   AL763                         Graphic Design (portfolio)     #642      NaN
1   CW057                                    Art (portfolio)     #700      NaN
2   CW807  Sport Coaching and Business Management - GAA (...     #700      NaN
3   CW817  Sport Coaching and Business Management - Rugby...     #700      NaN
4   CW827  Sport Coaching and Business Management - Socce...     #700      NaN
5   TU655  Computing (Networking Technologies) Learn and ...     #502      NaN
6   TU722  Process Instrumentation and Automation Learn a...     #346     #346
7   TU795                   Visual Merchandising and Display     #618      NaN
8   TR802                                     Dental Hygiene     #577     #565
9   TR803                                  Dental Technology     #543    #498*
10  DK767                   Community Youth Work (interview)     #240     #240
11  GA273                       Contemporary Art (portfolio)     #775      NaN
12  LY437                                          Animation     #183      NaN
13  LY447                             Fashion with Promotion     #189      NaN
14  LY457                         Graphic and Digital Design     #188     #188
15  SG231                                           Fine Art     #375     #375
22  SG335  Engineering in Mechatronic Systems (Interview ...      NaN        #

In [38]:
# Extracting courses where not everyone with those points were offered places
df2021_l76_random = random(df2021_l76)

In [39]:
df2021_l76_random

    code               title pointsR1 pointsR2
0  LY847  Veterinary Nursing     389*      NaN
1  TR803   Dental Technology     #543    #498*

In [40]:
# Extracting courses where all qualified applicants earned places
df2021_l76_aqa = aqa(df2021_l76)

In [41]:
df2021_l76_aqa

     code                                             title pointsR1 pointsR2
0   AL650                                          Business      AQA      AQA
1   AL660                                     Culinary Arts      AQA      AQA
2   AL661                                   Bar Supervision      AQA      NaN
3   AL663                   Business (Sport and Recreation)      AQA      AQA
4   AL761                      Hotel and Leisure Management      AQA      AQA
5   TU772                                Business (options)      AQA     250v
6   TU792                   Community and Youth Development      AQA     242v
7   WD003                                          Business      AQA      AQA
8   WD013                                     Legal Studies      AQA     206v
9   WD019                   Recreation and Sport Management      AQA      AQA
10  WD172                                     Culinary Arts      AQA      AQA
11  WD174                                           Tourism      AQA      NaN
12  WD182                            Electrical Engineering      AQA      NaN
13  WD205  Molecular Biology with Biopharmaceutical Science      AQA     262v
18  SG135         Business in Tourism with Event Management      194      AQA
19  SG232                                   Creative Design      270      AQA

In [42]:
# Extracting courses where there's new competition for available places
df2021_l76_comp = comp(df2021_l76)

In [43]:
df2021_l76_comp

    code                                              title pointsR1 pointsR2
0  TU708      Engineering (Common Entry with Award options)      117     263v
1  TU772                                 Business (options)      AQA     250v
2  TU792                    Community and Youth Development      AQA     242v
3  WD013                                      Legal Studies      AQA     206v
4  WD177  Science (Mol. Biology with Biopharm. Food Science      205     455v
5  WD205   Molecular Biology with Biopharmaceutical Science      AQA     262v

In [44]:
df2021_l76 = points(df2021_l76)

In [45]:
df2021_l76

,code,title,pointsR1,pointsR2,Round_1_Points,Round_2_Points
0,AL605,Music and Instrument Technology,211,NaN,211,NaN
1,AL630,Pharmacy Technician,308,NaN,308,NaN
2,AL631,Dental Nursing,311,NaN,311,NaN
3,AL632,Applied Science,297,NaN,297,NaN
4,AL650,Business,AQA,AQA,,
...,...,...,...,...,...,...
411,WD188,Applied Health Care,220,NaN,220,NaN
412,WD205,Molecular Biology with Biopharmaceutical Science,AQA,262v,,262
413,WD206,Electronic Engineering,180,NaN,180,NaN
414,WD207,Mechanical Engineering,172,NaN,172,NaN
415,WD208,Manufacturing Engineering,317,NaN,317,NaN

In [46]:
# Rename columns to match later dataframes
df2021_l76.rename(columns={'code': 'Course Code', 'title': 'INSTITUTION and COURSE'}, inplace=True)

In [47]:
df2021_l76

,Course Code,INSTITUTION and COURSE,pointsR1,pointsR2,Round_1_Points,Round_2_Points
0,AL605,Music and Instrument Technology,211,NaN,211,NaN
1,AL630,Pharmacy Technician,308,NaN,308,NaN
2,AL631,Dental Nursing,311,NaN,311,NaN
3,AL632,Applied Science,297,NaN,297,NaN
4,AL650,Business,AQA,AQA,,
...,...,...,...,...,...,...
411,WD188,Applied Health Care,220,NaN,220,NaN
412,WD205,Molecular Biology with Biopharmaceutical Science,AQA,262v,,262
413,WD206,Electronic Engineering,180,NaN,180,NaN
414,WD207,Mechanical Engineering,172,NaN,172,NaN
415,WD208,Manufacturing Engineering,317,NaN,317,NaN

In [48]:
# Save pandas data frame to disk.
df2021_l76.to_csv(path2021_l76)

## 2021 Level 8/7/6 Points Addendum

After the start of this project, the CAO website have released an excel file with additional 2021 points information. As of 13th of December 2021 they no longer link to the webpage with the points data, instead linking to the new excel file. The website used previously still appears to be live, and the code above will remain in the hopes they do not remove this link. It would be prudent to also load the excel file, however, not least because it contains additional points information such as EOS and Mid points values, which is the points information given in years prior to 2020. Including these values in the analysis will allow for a more valid comparison between the points values from all years.

In [49]:
# The points for levels 8, 7, and 6 were included in one spreadsheet on the CAO website
url2021_xlsx = 'http://www2.cao.ie/points/CAOPointsCharts2021.xlsx'

In [50]:
# Create a file path for the original data.
path2021_xlsx = 'cao-data/2021-points/2021-all-levels-points/cao2021_' + current_time + '.xlsx'

In [51]:
# Retrieve the excel file and save it 
urlrq.urlretrieve(url2021_xlsx, path2021_xlsx)

('cao-data/2021-points/2021-all-levels-points/cao2021_20211219_162629.xlsx',
 <http.client.HTTPMessage at 0x1525d4ac3a0>)

https://stackoverflow.com/questions/65250207/pandas-cannot-open-an-excel-xlsx-file to fix an error 'XLRDError: Excel xlsx file; not supported'.

In [52]:
# Load the 2021 data to a pandas dataframe
df2021_xlsx = pd.read_excel(url2021_xlsx, skiprows=11,  engine='openpyxl')

In [53]:
df2021_xlsx

,CATEGORY (ISCED Description),Course Title,Course Code,R1 Points,R1 Random,R2 Points,R2 Random,EOS Points,EOS Random,EOS Midpoints,Course Level,HEI,Test/Interview,AVP,v
0,Engineering and engineering trades,Music and Instrument Technology,AL605,211,NaN,NaN,NaN,211,NaN,319,6,Athlone Institute of Technology,NaN,NaN,NaN
1,Health,Pharmacy Technician,AL630,308,NaN,NaN,NaN,308,NaN,409,6,Athlone Institute of Technology,NaN,NaN,NaN
2,Health,Dental Nursing,AL631,311,NaN,NaN,NaN,311,NaN,400,6,Athlone Institute of Technology,NaN,NaN,NaN
3,Biological and related sciences,Applied Science,AL632,297,NaN,NaN,NaN,297,NaN,454,6,Athlone Institute of Technology,NaN,NaN,NaN
4,Business and administration,Business,AL650,AQA,NaN,AQA,NaN,AQA,NaN,351,6,Athlone Institute of Technology,NaN,avp,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1446,Information and Communication Technologies (ICTs),Creative Computing,WD211,270,NaN,NaN,NaN,270,NaN,392,8,Waterford Institute of Technology,NaN,NaN,NaN
1447,Personal services,Recreation and Sport Management,WD212,262,NaN,NaN,NaN,262,NaN,304,8,Waterford Institute of Technology,NaN,NaN,NaN
1448,Engineering and engineering trades,Mechanical and Manufacturing Engineering,WD230,230,NaN,230,NaN,230,NaN,361,8,Waterford Institute of Technology,NaN,avp,NaN
1449,Welfare,Early Childhood Care and Education,WD231,266,NaN,NaN,NaN,266,NaN,366,8,Waterford Institute of Technology,NaN,NaN,NaN
1450,Business and administration,Business Information Systems,WD232,261,NaN,261,NaN,261,NaN,329,8,Waterford Institute of Technology,NaN,avp,NaN

In [54]:
# Extract courses that required portfolio/test/interview/audition
df2021_portfolio_xslx = df2021_xlsx[df2021_xlsx['Test/Interview'].str.match("#", na=False)]
df2021_portfolio_xslx

,CATEGORY (ISCED Description),Course Title,Course Code,R1 Points,R1 Random,R2 Points,R2 Random,EOS Points,EOS Random,EOS Midpoints,Course Level,HEI,Test/Interview,AVP,v
26,Arts,Graphic Design (portfolio),AL763,642,NaN,NaN,NaN,642,NaN,811,7,Athlone Institute of Technology,#,NaN,NaN
56,Arts,Animation and Illustration (portfolio),AL861,575,NaN,NaN,NaN,575,NaN,760,8,Athlone Institute of Technology,#,NaN,NaN
57,Arts,Graphic and Digital Design (portfolio),AL863,747,NaN,NaN,NaN,747,NaN,808,8,Athlone Institute of Technology,#,NaN,NaN
65,Arts,Art (portfolio),CW038,#700,NaN,NaN,NaN,700,NaN,700,8,"Institute of Technology, Carlow",#,NaN,NaN
68,Arts,Art (portfolio),CW057,#700,NaN,NaN,NaN,700,NaN,700,7,"Institute of Technology, Carlow",#,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1306,Engineering and engineering trades,"Engineering in Mechatronic Systems (Interview,...",SG335,#,NaN,#,NaN,#,NaN,0,7,"Institute of Technology, Sligo",#,avp,NaN
1342,Arts,"Animation, Visual Effects and Motion Design (L...",TL701,NaN,NaN,NaN,NaN,NaN,NaN,0,7,"Institute of Technology, Tralee",#,NaN,NaN
1362,Arts,"Animation, Visual Effects and Motion Design (L...",TL801,718,NaN,NaN,NaN,718,NaN,823,8,"Institute of Technology, Tralee",#,NaN,NaN
1383,Welfare,Counselling with Addiction - Mature applicants...,TL889,NaN,NaN,NaN,NaN,NaN,NaN,0,8,"Institute of Technology, Tralee",#,NaN,NaN
1398,Arts,Music,WD027,321,NaN,NaN,NaN,321,NaN,437,8,Waterford Institute of Technology,#,NaN,NaN

In [55]:
# Extract courses where not everyone with that point total was offered a place
# Due to the different formatting, the previous function for this task cannot be reused
# Filters out the rows where the Random columns contain NaN values, leaving only '*' rows
df2021_randomr1 = df2021_xlsx[~df2021_xlsx['R1 Random'].isnull()]
df2021_randomr2 = df2021_xlsx[~df2021_xlsx['R2 Random'].isnull()]
df2021_random = pd.concat([df2021_randomr1, df2021_randomr2], ignore_index=True)
df2021_random = df2021_random.drop_duplicates()
df2021_random

,CATEGORY (ISCED Description),Course Title,Course Code,R1 Points,R1 Random,R2 Points,R2 Random,EOS Points,EOS Random,EOS Midpoints,Course Level,HEI,Test/Interview,AVP,v
0,Health,General Nursing,AL830,451,*,444,NaN,440,NaN,455,8,Athlone Institute of Technology,NaN,NaN,NaN
1,Health,Mental Health Nursing,AL832,440,*,431,NaN,431,NaN,451,8,Athlone Institute of Technology,NaN,NaN,NaN
2,Social and behavioural sciences,Applied Psychology,AL870,484,*,467,*,452,NaN,480,8,Athlone Institute of Technology,NaN,NaN,NaN
3,Biological and related sciences,Biomedical Science - Offered jointly by CIT an...,CR320,590,*,NaN,NaN,590,*,601,8,Cork Institute of Technology,NaN,NaN,NaN
4,Education,Home Economics and Business,CR930,518,*,NaN,NaN,510,*,542,8,Cork Institute of Technology,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
127,Law,Law (options),DN600,576,NaN,567,*,566,NaN,588,8,University College Dublin (NUI),NaN,NaN,NaN
128,Business and administration,Commerce International (options),DN660,555,NaN,554,*,554,NaN,567,8,University College Dublin (NUI),NaN,NaN,NaN
129,Social and behavioural sciences,Economics,DN710,534,NaN,532,*,522,NaN,544,8,University College Dublin (NUI),NaN,NaN,NaN
132,Education,Physical Education with concurrent Teacher Edu...,LM090,552,NaN,544,*,544,*,577,8,University of Limerick,NaN,NaN,NaN
133,Education,"Education, Home Economics and Religious Ed - w...",AS002,464,NaN,452,*,441,*,476,8,St. Angela`s College,NaN,NaN,NaN

In [56]:
# Rename columns to reuse AQA function
df2021_xlsx.rename(columns={'R1 Points': 'pointsR1', 'R2 Points ': 'pointsR2'}, inplace=True)

In [57]:
# Reuse function to find courses where all qualified applicants received offers
df2021_xlsx_aqa = aqa(df2021_xlsx)
df2021_xlsx_aqa

,CATEGORY (ISCED Description),Course Title,Course Code,pointsR1,R1 Random,pointsR2,R2 Random,EOS Points,EOS Random,EOS Midpoints,Course Level,HEI,Test/Interview,AVP,v
0,Business and administration,Business,AL650,AQA,NaN,AQA,NaN,AQA,NaN,351,6,Athlone Institute of Technology,NaN,avp,NaN
1,Personal services,Culinary Arts,AL660,AQA,NaN,AQA,NaN,AQA,NaN,271,6,Athlone Institute of Technology,NaN,avp,NaN
2,Personal services,Bar Supervision,AL661,AQA,NaN,NaN,NaN,153,NaN,279,6,Athlone Institute of Technology,NaN,avp,NaN
3,Personal services,Business (Sport and Recreation),AL663,AQA,NaN,AQA,NaN,AQA,NaN,311,6,Athlone Institute of Technology,NaN,avp,NaN
4,Personal services,Hotel and Leisure Management,AL761,AQA,NaN,AQA,NaN,AQA,NaN,306,7,Athlone Institute of Technology,NaN,avp,NaN
5,Engineering and engineering trades,Engineering (Common Entry with Award options),TU708,AQA,NaN,263,NaN,263,NaN,384,7,Technological University Dublin,NaN,avp,v
6,Business and administration,Business (options),TU772,AQA,NaN,250,NaN,AQA,NaN,408,7,Technological University Dublin,NaN,avp,v
7,Social and behavioural sciences,Community and Youth Development,TU792,AQA,NaN,242,NaN,AQA,NaN,310,7,Technological University Dublin,NaN,avp,v
8,Education,Early Childhood - Teaching and Learning (part-...,MH801,AQA,NaN,AQA,NaN,AQA,NaN,319,8,Maynooth University,NaN,avp,NaN
9,Business and administration,Business,WD003,AQA,NaN,AQA,NaN,AQA,NaN,367,6,Waterford Institute of Technology,NaN,avp,NaN
10,Law,Legal Studies,WD013,AQA,NaN,206,NaN,AQA,NaN,376,6,Waterford Institute of Technology,NaN,avp,v
11,Personal services,Recreation and Sport Management,WD019,AQA,NaN,AQA,NaN,AQA,NaN,304,7,Waterford Institute of Technology,NaN,avp,NaN
12,Personal services,Culinary Arts,WD172,AQA,NaN,AQA,NaN,AQA,NaN,329,6,Waterford Institute of Technology,NaN,avp,NaN
13,Personal services,Tourism,WD174,AQA,NaN,NaN,NaN,AQA,NaN,320,6,Waterford Institute of Technology,NaN,NaN,NaN
14,Engineering and engineering trades,Electrical Engineering,WD182,AQA,NaN,NaN,NaN,AQA,NaN,363,7,Waterford Institute of Technology,NaN,NaN,NaN
15,Biological and related sciences,Molecular Biology with Biopharmaceutical Science,WD205,AQA,NaN,262,NaN,AQA,NaN,434,7,Waterford Institute of Technology,NaN,avp,NaN
21,Personal services,Business in Tourism with Event Management,SG135,194,NaN,AQA,NaN,AQA,NaN,328,7,"Institute of Technology, Sligo",NaN,avp,NaN
22,Arts,Creative Design,SG232,270,NaN,AQA,NaN,AQA,NaN,301,7,"Institute of Technology, Sligo",NaN,avp,NaN

In [58]:
# Create a file path for the pandas data.
path2021_all = 'cao-data/2021-points/2021-all-levels-points/cao2021_' + current_time + '.csv'

In [59]:
# Save pandas data frame to disk.
df2021_xlsx.to_csv(path2021_all)

In [60]:
# Split 2021 df into df with l8 courses
df2021_xlsx_l8 = df2021_xlsx[df2021_xlsx['Course Level'] == 8]
df2021_xlsx_l8

,CATEGORY (ISCED Description),Course Title,Course Code,pointsR1,R1 Random,pointsR2,R2 Random,EOS Points,EOS Random,EOS Midpoints,Course Level,HEI,Test/Interview,AVP,v
29,Information and Communication Technologies (ICTs),Software Design for Virtual Reality and Gaming,AL801,300,NaN,NaN,NaN,300,NaN,359,8,Athlone Institute of Technology,NaN,NaN,NaN
30,Information and Communication Technologies (ICTs),Software Design in Artificial Intelligence for...,AL802,313,NaN,NaN,NaN,313,NaN,381,8,Athlone Institute of Technology,NaN,NaN,NaN
31,Information and Communication Technologies (ICTs),Software Design for Mobile Apps and Connected ...,AL803,350,NaN,NaN,NaN,350,NaN,398,8,Athlone Institute of Technology,NaN,NaN,NaN
32,Information and Communication Technologies (ICTs),Computer Engineering for Network Infrastructure,AL805,321,NaN,NaN,NaN,321,NaN,381,8,Athlone Institute of Technology,NaN,NaN,NaN
33,Architecture and construction,Quantity Surveying,AL810,328,NaN,NaN,NaN,328,NaN,377,8,Athlone Institute of Technology,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1446,Information and Communication Technologies (ICTs),Creative Computing,WD211,270,NaN,NaN,NaN,270,NaN,392,8,Waterford Institute of Technology,NaN,NaN,NaN
1447,Personal services,Recreation and Sport Management,WD212,262,NaN,NaN,NaN,262,NaN,304,8,Waterford Institute of Technology,NaN,NaN,NaN
1448,Engineering and engineering trades,Mechanical and Manufacturing Engineering,WD230,230,NaN,230,NaN,230,NaN,361,8,Waterford Institute of Technology,NaN,avp,NaN
1449,Welfare,Early Childhood Care and Education,WD231,266,NaN,NaN,NaN,266,NaN,366,8,Waterford Institute of Technology,NaN,NaN,NaN
1450,Business and administration,Business Information Systems,WD232,261,NaN,261,NaN,261,NaN,329,8,Waterford Institute of Technology,NaN,avp,NaN

In [61]:
# Create a file path for the pandas data.
path2021_xlsx_l8 = 'cao-data/2021-points/2021-level-8-points/cao2021_xlsx_l8_' + current_time + '.csv'

In [62]:
# Save pandas data frame to disk.
df2021_xlsx_l8.to_csv(path2021_xlsx_l8)

In [63]:
# Split 2021 df into df with l7/6 courses
df2021_xlsx_l76 = df2021_xlsx[df2021_xlsx['Course Level'] <= 7]
df2021_xlsx_l76

,CATEGORY (ISCED Description),Course Title,Course Code,pointsR1,R1 Random,pointsR2,R2 Random,EOS Points,EOS Random,EOS Midpoints,Course Level,HEI,Test/Interview,AVP,v
0,Engineering and engineering trades,Music and Instrument Technology,AL605,211,NaN,NaN,NaN,211,NaN,319,6,Athlone Institute of Technology,NaN,NaN,NaN
1,Health,Pharmacy Technician,AL630,308,NaN,NaN,NaN,308,NaN,409,6,Athlone Institute of Technology,NaN,NaN,NaN
2,Health,Dental Nursing,AL631,311,NaN,NaN,NaN,311,NaN,400,6,Athlone Institute of Technology,NaN,NaN,NaN
3,Biological and related sciences,Applied Science,AL632,297,NaN,NaN,NaN,297,NaN,454,6,Athlone Institute of Technology,NaN,NaN,NaN
4,Business and administration,Business,AL650,AQA,NaN,AQA,NaN,AQA,NaN,351,6,Athlone Institute of Technology,NaN,avp,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1434,Health,Applied Health Care,WD188,220,NaN,NaN,NaN,220,NaN,402,7,Waterford Institute of Technology,NaN,NaN,NaN
1441,Biological and related sciences,Molecular Biology with Biopharmaceutical Science,WD205,AQA,NaN,262,NaN,AQA,NaN,434,7,Waterford Institute of Technology,NaN,avp,NaN
1442,Engineering and engineering trades,Electronic Engineering,WD206,180,NaN,NaN,NaN,180,NaN,367,7,Waterford Institute of Technology,NaN,NaN,NaN
1443,Engineering and engineering trades,Mechanical Engineering,WD207,172,NaN,NaN,NaN,172,NaN,356,7,Waterford Institute of Technology,NaN,NaN,NaN
1444,Engineering and engineering trades,Manufacturing Engineering,WD208,317,NaN,NaN,NaN,317,NaN,368,7,Waterford Institute of Technology,NaN,NaN,NaN

In [64]:
# Create a file path for the pandas data.
path2021_xlsx_l76 = 'cao-data/2021-points/2021-level-7-and-6-points/cao2021_xlsx_l76_' + current_time + '.csv'

In [65]:
# Save pandas data frame to disk.
df2021_xlsx_l76.to_csv(path2021_xlsx_l76)

It's worth noting that the excel file appears to have a greater number of courses listed than the original 2021 webpage.

## 2020 Level 8/7/6 Points

In [66]:
# The points for levels 8, 7, and 6 were included in one spreadsheet on the CAO website
url2020 = 'http://www2.cao.ie/points/CAOPointsCharts2020.xlsx'

In [67]:
# Create a file path for the original data.
path2020_xlsx = 'cao-data/2020-points/2020-all-levels-points/cao2020_' + current_time + '.xlsx'

In [68]:
# Retrieve the excel file and save it 
urlrq.urlretrieve(url2020, path2020_xlsx)

('cao-data/2020-points/2020-all-levels-points/cao2020_20211219_162629.xlsx',
 <http.client.HTTPMessage at 0x1525dc2ad90>)

In [69]:
# Load the 2020 data to a pandas dataframe
df2020 = pd.read_excel(url2020, skiprows=10,  engine='openpyxl')

In [70]:
df2020

,CATEGORY (i.e.ISCED description),COURSE TITLE,COURSE CODE2,R1 POINTS,R1 Random *,R2 POINTS,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Business and administration,International Business,AC120,209,NaN,NaN,NaN,209,NaN,280,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Humanities (except languages),Liberal Arts,AC137,252,NaN,NaN,NaN,252,NaN,270,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Arts,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Arts,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Arts,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1459,Manufacturing and processing,Manufacturing Engineering,WD208,188,NaN,NaN,NaN,188,NaN,339,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1460,Information and Communication Technologies (ICTs),Software Systems Development,WD210,279,NaN,NaN,NaN,279,NaN,337,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1461,Information and Communication Technologies (ICTs),Creative Computing,WD211,271,NaN,NaN,NaN,271,NaN,318,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1462,Personal services,Recreation and Sport Management,WD212,270,NaN,NaN,NaN,270,NaN,349,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1463,Engineering and engineering trades,Mechanical and Manufacturing Engineering,WD230,253,NaN,NaN,NaN,253,NaN,369,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [71]:
# Rename columns to match later dataframes
df2020.rename(columns={'COURSE CODE2': 'Course Code', 'COURSE TITLE': 'Course Title',
                      'R1 POINTS': 'pointsR1', 'R2 POINTS': 'pointsR2'}, inplace=True)

In [72]:
df2020

,CATEGORY (i.e.ISCED description),Course Title,Course Code,pointsR1,R1 Random *,pointsR2,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Business and administration,International Business,AC120,209,NaN,NaN,NaN,209,NaN,280,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Humanities (except languages),Liberal Arts,AC137,252,NaN,NaN,NaN,252,NaN,270,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Arts,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Arts,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Arts,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1459,Manufacturing and processing,Manufacturing Engineering,WD208,188,NaN,NaN,NaN,188,NaN,339,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1460,Information and Communication Technologies (ICTs),Software Systems Development,WD210,279,NaN,NaN,NaN,279,NaN,337,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1461,Information and Communication Technologies (ICTs),Creative Computing,WD211,271,NaN,NaN,NaN,271,NaN,318,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1462,Personal services,Recreation and Sport Management,WD212,270,NaN,NaN,NaN,270,NaN,349,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1463,Engineering and engineering trades,Mechanical and Manufacturing Engineering,WD230,253,NaN,NaN,NaN,253,NaN,369,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [73]:
# Extract courses that required portfolio/test/interview/audition
df2020_portfolio = df2020[df2020['Test/Interview #'].str.match("#", na=False)]

In [74]:
df2020_portfolio

,CATEGORY (i.e.ISCED description),Course Title,Course Code,pointsR1,R1 Random *,pointsR2,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
2,Arts,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Arts,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Arts,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,Education,Education & Design or Fine Art (Second Level T...,AD202,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,Arts,Fine Art (portfolio),AD204,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1382,Arts,Design - Visual Communication,TU973,717,NaN,NaN,NaN,717,NaN,865,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1383,Arts,Fine Art,TU974,709,NaN,563,NaN,563,NaN,826,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1384,Arts,Interior Design,TU975,632,NaN,NaN,NaN,632,NaN,879,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1385,Arts,Photography,TU976,695,NaN,NaN,NaN,695,NaN,926,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1411,Arts,Music,WD027,262,NaN,NaN,NaN,262,NaN,409,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [75]:
# Extract courses where not everyone with that point total was offered a place
# Due to the different formatting, the previous function for this task cannot be reused
# Filters out the rows where the Random columns contain NaN values, leaving only '*' rows
df2020_randomr1 = df2020[~df2020['R1 Random *'].isnull()]
df2020_randomr2 = df2020[~df2020['R2 Random*'].isnull()]
df2020_random = pd.concat([df2020_randomr1, df2020_randomr2], ignore_index=True)
df2020_random = df2020_random.drop_duplicates()

In [76]:
df2020_random

,CATEGORY (i.e.ISCED description),Course Title,Course Code,pointsR1,R1 Random *,pointsR2,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Health,Psychiatric Nursing,AL832,387,*,384,NaN,384,NaN,399,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Education,"Education, Home Economics and Religious Ed - w...",AS002,441,*,434,*,434,*,466,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Education,"Education, Home Economics and Irish - with con...",AS003,440,*,440,NaN,440,NaN,484,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Health,General Nursing,AS110,419,*,NaN,NaN,419,*,431,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Health,Intellectual Disability Nursing,AS130,336,*,328,NaN,317,NaN,339,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
79,Law,Law,TR004,566,NaN,565,*,565,*,578,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
80,Social and behavioural sciences,Psychology,TR006,567,NaN,555,*,555,*,578,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
81,Engineering and engineering trades,Engineering,TR032,510,NaN,509,*,508,NaN,533,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
86,Business and administration,Business Studies and German,TR086,509,NaN,499,*,499,NaN,518,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
87,Health,Midwifery,TR913,478,NaN,477,*,473,*,508,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [77]:
# Reuse function to find courses where all qualified applicants received offers
df2020_aqa = aqa(df2020)

In [78]:
df2020_aqa

,CATEGORY (i.e.ISCED description),Course Title,Course Code,pointsR1,R1 Random *,pointsR2,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Information and Communication Technologies (ICTs),Software Design,AL600,AQA,NaN,NaN,NaN,104,NaN,279,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Engineering and engineering trades,Computer Engineering,AL601,AQA,NaN,219,NaN,112,NaN,192,...,avp,v,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Engineering and engineering trades,Mechanical Engineering,AL602,AQA,NaN,NaN,NaN,260,NaN,424,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Architecture and construction,Civil Engineering,AL604,AQA,NaN,AQA,NaN,AQA,NaN,244,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Engineering and engineering trades,Music and Instrument Technology,AL605,AQA,NaN,AQA,NaN,154,NaN,306,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,Personal services,Culinary Arts,AL660,AQA,NaN,AQA,NaN,112,NaN,270,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,Personal services,Bar Supervision,AL661,AQA,NaN,AQA,NaN,101,NaN,241,...,avp,v,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,Personal services,Business (Sport and Recreation),AL663,AQA,NaN,AQA,NaN,120,NaN,262,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,Business and administration,Business,CW006,AQA,NaN,AQA,NaN,AQA,NaN,254,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,Social and behavioural sciences,Applied Social Care,DB528,AQA,NaN,AQA,NaN,AQA,NaN,337,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
10,Arts,Sound Engineering and Music Production,DB534,AQA,NaN,AQA,NaN,AQA,NaN,338,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,Arts,Film and Creative Media,DB576,AQA,NaN,AQA,NaN,AQA,NaN,338,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12,Business and administration,Business - Applied Entrepreneurship,DL701,AQA,NaN,AQA,NaN,AQA,NaN,359,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,Information and Communication Technologies (ICTs),Computing,GC435,AQA,NaN,AQA,NaN,96,NaN,279,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,Journalism and information,Communications,GC465,AQA,NaN,NaN,NaN,AQA,NaN,349,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,Arts,Film and TV Production,GC466,AQA,NaN,AQA,NaN,AQA,NaN,339,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,Business and administration,Business (Common Entry with Award options),TU772,AQA,NaN,227,NaN,AQA,NaN,317,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17,Business and administration,Business,WD003,AQA,NaN,171,NaN,AQA,NaN,372,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18,Agriculture,Horticulture (Dublin - National Botanic Gardens),WD097,AQA,NaN,NaN,NaN,AQA,NaN,408,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
19,Information and Communication Technologies (ICTs),Software Systems Development,WD151,AQA,NaN,AQA,NaN,AQA,NaN,356,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,Arts,Visual Art,WD152,AQA,NaN,NaN,NaN,AQA,NaN,317,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
21,Personal services,Culinary Arts,WD172,AQA,NaN,AQA,NaN,AQA,NaN,301,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
22,Personal services,Hospitality Studies,WD173,AQA,NaN,NaN,NaN,AQA,NaN,310,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23,Personal services,Tourism,WD174,AQA,NaN,NaN,NaN,AQA,NaN,226,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
24,Engineering and engineering trades,Electrical Engineering,WD182,AQA,NaN,NaN,NaN,AQA,NaN,302,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25,Arts,Arts (options),WD200,AQA,NaN,AQA,NaN,AQA,NaN,336,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [79]:
# Create a file path for the pandas data.
path2020 = 'cao-data/2020-points/2020-all-levels-points/cao2020_' + current_time + '.csv'

In [80]:
# Save pandas data frame to disk.
df2020.to_csv(path2020)

In [81]:
# Split 2020 df into df with l8 courses
df2020_l8 = df2020[df2020['LEVEL'] == 8]
df2020_l8

,CATEGORY (i.e.ISCED description),Course Title,Course Code,pointsR1,R1 Random *,pointsR2,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
0,Business and administration,International Business,AC120,209,NaN,NaN,NaN,209,NaN,280,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Humanities (except languages),Liberal Arts,AC137,252,NaN,NaN,NaN,252,NaN,270,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,Arts,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,Arts,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Arts,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,NaN,NaN,#+matric,NaN,#+matric,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1455,Arts,Arts (options),WD200,AQA,NaN,AQA,NaN,AQA,NaN,336,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1460,Information and Communication Technologies (ICTs),Software Systems Development,WD210,279,NaN,NaN,NaN,279,NaN,337,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1461,Information and Communication Technologies (ICTs),Creative Computing,WD211,271,NaN,NaN,NaN,271,NaN,318,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1462,Personal services,Recreation and Sport Management,WD212,270,NaN,NaN,NaN,270,NaN,349,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1463,Engineering and engineering trades,Mechanical and Manufacturing Engineering,WD230,253,NaN,NaN,NaN,253,NaN,369,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [82]:
# Create a file path for the pandas data.
path2020_l8 = 'cao-data/2020-points/2020-level-8-points/cao2020_l8_' + current_time + '.csv'

In [83]:
# Save pandas data frame to disk.
df2020_l8.to_csv(path2020_l8)

In [84]:
# Split 2020 df into df with l7/6 courses
df2020_l76 = df2020[df2020['LEVEL'] <= 7]
df2020_l76

,CATEGORY (i.e.ISCED description),Course Title,Course Code,pointsR1,R1 Random *,pointsR2,R2 Random*,EOS,EOS Random *,EOS Mid-point,...,avp,v,Column1,Column2,Column3,Column4,Column5,Column6,Column7,Column8
12,Information and Communication Technologies (ICTs),Software Design,AL600,AQA,NaN,NaN,NaN,104,NaN,279,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,Engineering and engineering trades,Computer Engineering,AL601,AQA,NaN,219,NaN,112,NaN,192,...,avp,v,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
14,Engineering and engineering trades,Mechanical Engineering,AL602,AQA,NaN,NaN,NaN,260,NaN,424,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
15,Architecture and construction,Civil Engineering,AL604,AQA,NaN,AQA,NaN,AQA,NaN,244,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,Engineering and engineering trades,Music and Instrument Technology,AL605,AQA,NaN,AQA,NaN,154,NaN,306,...,avp,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1449,Health,Applied Health Care,WD188,201,NaN,NaN,NaN,201,NaN,349,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1456,Health,Molecular Biology with Biopharmaceutical Science,WD205,228,NaN,NaN,NaN,228,NaN,446,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1457,Engineering and engineering trades,Electronic Engineering,WD206,179,NaN,NaN,NaN,179,NaN,373,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1458,Engineering and engineering trades,Mechanical Engineering,WD207,198,NaN,NaN,NaN,198,NaN,365,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1459,Manufacturing and processing,Manufacturing Engineering,WD208,188,NaN,NaN,NaN,188,NaN,339,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [85]:
# Create a file path for the pandas data.
path2020_l76 = 'cao-data/2020-points/2020-level-7-and-6-points/cao2020_l76_' + current_time + '.csv'

In [86]:
# Save pandas data frame to disk.
df2020_l76.to_csv(path2020_l76)

## 2019 Level 8 Points

In [87]:
# Request CAO website for 2019 level 8 url
url2019_l8 = 'http://www2.cao.ie/points/lvl8_19.pdf'

In [88]:
# Create a file path for the original data.
path2019_l8_pdf = 'cao-data/2019-points/2019-level-8-points/cao2019_l8_' + current_time + '.pdf'

In [89]:
# Save pdf to disk
urlrq.urlretrieve(url2019_l8, path2019_l8_pdf)

('cao-data/2019-points/2019-level-8-points/cao2019_l8_20211219_162629.pdf',
 <http.client.HTTPMessage at 0x1525d4ac190>)

https://stackoverflow.com/questions/68408688/how-to-extract-multiples-tables-from-one-pdf-file-using-pandas-and-tabula-py Tabula was mostly used based on the method used in this answer throughout this notebook. Howver, it had to be adapted here as there was an issue concating the tables by this method later in the code when trying to strip characters from the points columns, which resulted in all entries after page 1 in the pdf being replaced with NaN values.

In [90]:
# Read pdf into panda using tabula
# Using concat as tabula creates a new dataframe for each page of the pdf
# Takes pandas options to remove header as tabula assigns first row on each new page as the header 
df2019_l8_load = tabula.read_pdf("http://www2.cao.ie/points/lvl8_19.pdf", 
                                      pages = 'all', pandas_options={'header': None}, multiple_tables=False)

In [91]:
df2019_l8_load

[               0                                                  1    2    3
 0    Course Code                             INSTITUTION and COURSE  EOS  Mid
 1            NaN                    Athlone Institute of Technology  NaN  NaN
 2          AL801    Software Design with Virtual Reality and Gaming  304  328
 3          AL802               Software Design with Cloud Computing  301  306
 4          AL803  Software Design with Mobile Apps and Connected...  309  337
 ..           ...                                                ...  ...  ...
 961        WD200                                     Arts (options)  221  296
 962        WD210                       Software Systems Development  271  329
 963        WD211                                 Creative Computing  275  322
 964        WD212                    Recreation and Sport Management  274  311
 965        WD230           Mechanical and Manufacturing Engineering  273  348

 [966 rows x 4 columns]]

In [92]:
type(df2019_l8_load)

list

In [93]:
# Convert the df list given by tabula to an actual df that pandas recognises
df2019_l8_load = pd.concat(df2019_l8_load)

In [94]:
df2019_l8_load

               0                                                  1    2    3
0    Course Code                             INSTITUTION and COURSE  EOS  Mid
1            NaN                    Athlone Institute of Technology  NaN  NaN
2          AL801    Software Design with Virtual Reality and Gaming  304  328
3          AL802               Software Design with Cloud Computing  301  306
4          AL803  Software Design with Mobile Apps and Connected...  309  337
..           ...                                                ...  ...  ...
961        WD200                                     Arts (options)  221  296
962        WD210                       Software Systems Development  271  329
963        WD211                                 Creative Computing  275  322
964        WD212                    Recreation and Sport Management  274  311
965        WD230           Mechanical and Manufacturing Engineering  273  348

[966 rows x 4 columns]

In [95]:
# Set the first row of new dataframe as header
# https://www.codegrepper.com/code-examples/python/frameworks/django/change+header+to+first+row+pandas
df2019_l8_load.columns = df2019_l8_load.iloc[0]
df2019_l8_load = df2019_l8_load[1:]

In [96]:
df2019_l8_load

0   Course Code                             INSTITUTION and COURSE  EOS  Mid
1           NaN                    Athlone Institute of Technology  NaN  NaN
2         AL801    Software Design with Virtual Reality and Gaming  304  328
3         AL802               Software Design with Cloud Computing  301  306
4         AL803  Software Design with Mobile Apps and Connected...  309  337
5         AL805        Network Management and Cloud Infrastructure  329  442
..          ...                                                ...  ...  ...
961       WD200                                     Arts (options)  221  296
962       WD210                       Software Systems Development  271  329
963       WD211                                 Creative Computing  275  322
964       WD212                    Recreation and Sport Management  274  311
965       WD230           Mechanical and Manufacturing Engineering  273  348

[965 rows x 4 columns]

In [97]:
# Reset index as tabula had a new index for each page of the pdf
df2019_l8 = df2019_l8_load.reset_index()

In [98]:
# Delete rows that contain NaN in the Course Code column
df2019_l8 = df2019_l8.dropna(subset = ['Course Code'])

In [99]:
# Rename column to match df from other years
df2019_l8.rename(columns={'INSTITUTION and COURSE': 'Course Title'}, inplace=True)

In [100]:
# Extract rows where points contain a symbol and include them in new df
# All courses with # required Test / Interview / Portfolio / Audition
df2019_l8_portfolio = df2019_l8[df2019_l8['EOS'].str.match("#", na=False)]

In [101]:
df2019_l8_portfolio

,index,Course Code,Course Title,EOS,Mid
24,25,AL861,Animation and Illustration (portfolio),#615,899
25,26,AL863,Graphic and Digital Design (portfolio),#703,898
31,32,CW038,"Art (portfolio, Wexford)",#700,700
58,59,CW858,"Sports Management and Coaching (options, portf...",#700,700
74,75,CR121,Music at CIT Cork School of Music,#633,1052
...,...,...,...,...,...
858,859,MH802,"Community and Youth Work (part-time, in service",#,NaN
859,860,MH803,"Local Studies or Community Studies (part-time,...",#,NaN
879,880,SG244,Fine Art,#355,496
924,925,TL889,Counselling with Addiction - Mature applicants...,#,NaN
934,935,WD027,Music,#290,317

In [102]:
# Extracting courses where not everyone with those points were offered places
df2019_l8_random = df2019_l8[df2019_l8['EOS'].str[-1] == '*']

In [103]:
df2019_l8_random

,index,Course Code,Course Title,EOS,Mid
129,130,CK201,Commerce,465*,489
163,164,CK704,Occupational Therapy,532*,554
166,167,CK707,Medical and Health Sciences,510*,543
172,173,CK791,Medicine - Graduate Entry (GAMSAT required),#58*,59
179,180,CM001,Education - Primary Teaching,452*,462
211,212,DC002,Education - Primary Teaching,462*,485
452,453,RC004,Physiotherapy,532*,542
460,461,TR006,Psychology,555*,577
463,464,TR012,History and Political Science,532*,557
467,468,TR018,Law and French,532*,554
478,479,TR032,Engineering,487*,520
479,480,TR033,Computer Science,465*,488
480,481,TR034,Management Science and Information Systems Stu...,589*,602
487,488,TR052,Dental Science,590*,602
488,489,TR053,Physiotherapy,533*,544
492,493,TR060,Biological and Biomedical Sciences,510*,542
493,494,TR061,Chemical Sciences,488*,520
495,496,TR063,Physical Sciences,498*,543
496,497,TR072,Pharmacy,555*,577
498,499,TR081,"Business, Economic and Social Studies (BESS)",518*,542
501,502,TR084,Social Studies (Social Work),420*,462
507,508,TR091,General Nursing (Meath and St James`s),393*,420
508,509,TR093,General Nursing (Adelaide School of Nursing),#378*,409
511,512,TR911,Children`s and General Nursing (Integrated),476*,487
532,533,DN401,Medicine - Graduate Entry (GAMSAT required),#59*,61
538,539,DN440,"Biomedical, Health and Life Sciences",565*,579
540,541,DN451,Children`s and General Nursing (Integrated),462*,499
546,547,DN600,Law (options),520*,532
548,549,DN650,Commerce,498*,510
574,575,DK877,Midwifery,398*,441
617,618,GA880,General Nursing - Mayo Campus,389*,400
686,687,GY501,"Medicine (five year/six year course, HPAT requ...",#726*,731
709,710,LY918,Psychiatric Nursing,291*,332
716,717,MI005,Education - Primary Teaching,473*,506
798,799,LM090,Physical Education with concurrent Teacher Edu...,498*,520
805,806,LM100,Physiotherapy,565*,577
806,807,LM101,Medicine - Graduate Entry (GAMSAT required),#55*,57
817,818,LM150,General Nursing,440*,463
819,820,LM154,Intellectual Disability Nursing,381*,408
825,826,MH001,Education - Primary Teaching (Froebel),496*,520
826,827,MH002,Education - Primary Teaching - Gaeltacht Appli...,#441*,NaN
861,862,AS001,"Education, Home Economics and Biology - with c...",456*,497
862,863,AS002,"Education, Home Economics and Religious Ed - w...",400*,433
866,867,AS110,General Nursing,391*,409
926,927,TL891,Mental Health Nursing and Mature Applicants,367*,379

In [104]:
# Extracting courses where all qualified applicants earned places
df2019_l8_aqa = df2019_l8[df2019_l8['EOS'].str.match("AQA", na=False)]

In [105]:
df2019_l8_aqa

Empty DataFrame
Columns: [index, Course Code, Course Title, EOS, Mid]
Index: []

In [106]:
# Add new column with EOS point numbers removing non-digit characters
df2019_l8 = df2019_l8.assign(EOS_Points=df2019_l8['EOS'].str.replace(r'\D', '', regex=True))

In [107]:
df2019_l8

,index,Course Code,Course Title,EOS,Mid,EOS_Points
1,2,AL801,Software Design with Virtual Reality and Gaming,304,328,304
2,3,AL802,Software Design with Cloud Computing,301,306,301
3,4,AL803,Software Design with Mobile Apps and Connected...,309,337,309
4,5,AL805,Network Management and Cloud Infrastructure,329,442,329
5,6,AL810,Quantity Surveying,307,349,307
...,...,...,...,...,...,...
960,961,WD200,Arts (options),221,296,221
961,962,WD210,Software Systems Development,271,329,271
962,963,WD211,Creative Computing,275,322,275
963,964,WD212,Recreation and Sport Management,274,311,274
964,965,WD230,Mechanical and Manufacturing Engineering,273,348,273

Have to strip some characters from Mid points total, where the letters 'ic' appear before the points total, which appears to be due to '#+matic' entries in the pdf.

In [108]:
# Add new column with Mid point numbers removing non-digit characters
df2019_l8 = df2019_l8.assign(Mid_Points=df2019_l8['Mid'].str.replace(r'\D', '', regex=True))

In [109]:
df2019_l8

,index,Course Code,Course Title,EOS,Mid,EOS_Points,Mid_Points
1,2,AL801,Software Design with Virtual Reality and Gaming,304,328,304,328
2,3,AL802,Software Design with Cloud Computing,301,306,301,306
3,4,AL803,Software Design with Mobile Apps and Connected...,309,337,309,337
4,5,AL805,Network Management and Cloud Infrastructure,329,442,329,442
5,6,AL810,Quantity Surveying,307,349,307,349
...,...,...,...,...,...,...,...
960,961,WD200,Arts (options),221,296,221,296
961,962,WD210,Software Systems Development,271,329,271,329
962,963,WD211,Creative Computing,275,322,275,322
963,964,WD212,Recreation and Sport Management,274,311,274,311
964,965,WD230,Mechanical and Manufacturing Engineering,273,348,273,348

In [110]:
# Create a file path for the pandas data.
path2019_l8 = 'cao-data/2019-points/2019-level-8-points/cao2019_l8_' + current_time + '.csv'

In [111]:
# Save pandas data frame to disk.
df2019_l8.to_csv(path2019_l8)

## 2019 Level 7/6 Points

In [112]:
# Request CAO website for 2019 level 7 and 6 url
url2019_l76 = 'http://www2.cao.ie/points/lvl76_19.pdf'

In [113]:
# Create a file path for the original data.
path2019_l76_pdf = 'cao-data/2019-points/2019-level-7-and-6-points/cao2019_l76_' + current_time + '.pdf'

In [114]:
# Save pdf to disk
urlrq.urlretrieve(url2019_l76, path2019_l76_pdf)

('cao-data/2019-points/2019-level-7-and-6-points/cao2019_l76_20211219_162629.pdf',
 <http.client.HTTPMessage at 0x1525d3ca4f0>)

In [115]:
# Read pdf into panda using tabula
# Using concat as tabula creates a new dataframe for each page of the pdf
# Takes pandas options to remove header as tabula assigns first row on each new page as the header 
df2019_l76_load = pd.concat(tabula.read_pdf("http://www2.cao.ie/points/lvl76_19.pdf", 
                                      pages = 'all', pandas_options={'header': None}))

In [116]:
# Have a look at the imported data
df2019_l76_load

        0                                                  1    2    3
0     NaN                                ADMISSION DATA 2019  NaN  NaN
1     NaN                                      End of Season  NaN  NaN
2     NaN                                         Level 6, 7  NaN  NaN
3     NaN  The details  given are for general information...  NaN  NaN
4       *   Not all on this points score were offered places  NaN  NaN
..    ...                                                ...  ...  ...
1   WD188                                Applied Health Care  206  339
2   WD205   Molecular Biology with Biopharmaceutical Science  208  441
3   WD206                             Electronic Engineering  191  322
4   WD207                             Mechanical Engineering  179  330
5   WD208                          Manufacturing Engineering  195  330

[495 rows x 4 columns]

In [117]:
# Rename the columns to match the 2019 level 8 data
df2019_l76_load.columns = ['Course Code', 'Course Title', 'EOS', 'Mid']

In [118]:
# With the 2019 level 8 data, tabula ignored the introductory information 
# But it is included in the 2019 level 7 and 6 data so we have to remove it
# Reusing regular expressions to extract rows with the course codes we want
df2019_l76 = df2019_l76_load[df2019_l76_load['Course Code'].str.match(re_course, na=False)]

In [119]:
# Reset index as tabula had a new index for each page of the pdf
df2019_l76 = df2019_l76.reset_index()

In [120]:
df2019_l76

,index,Course Code,Course Title,EOS,Mid
0,10,AL600,Software Design,205,306
1,11,AL601,Computer Engineering,196,272
2,12,AL602,Mechanical Engineering,258,424
3,13,AL604,Civil Engineering,252,360
4,14,AL630,Pharmacy Technician,306,366
...,...,...,...,...,...
456,1,WD188,Applied Health Care,206,339
457,2,WD205,Molecular Biology with Biopharmaceutical Science,208,441
458,3,WD206,Electronic Engineering,191,322
459,4,WD207,Mechanical Engineering,179,330
460,5,WD208,Manufacturing Engineering,195,330

In [121]:
# Extract rows where points contain a symbol and include them in new df
# All courses with # required Test / Interview / Portfolio / Audition
df2019_l76_portfolio = df2019_l76[df2019_l76['EOS'].str.match("#", na=False)]

In [122]:
df2019_l76_portfolio

,index,Course Code,Course Title,EOS,Mid
27,37,AL763,Graphic Design (portfolio),#626,820
35,46,CW057,"Art (portfolio, Wexford)",#700,700
57,16,CW807,Sport Coaching and Business Management - GAA (...,#700,700
58,17,CW817,Sport Coaching and Business Management - Rugby...,#700,700
59,18,CW827,Sport Coaching and Business Management - Socce...,#700,700
155,11,DT598,Visual Merchandising and Display,#463,873
195,1,TA014,Advertising and Marketing Communications,#288,676
225,34,TR802,Dental Hygiene,#520,531
226,35,TR803,Dental Technology,#367,477
241,51,DK767,Community Youth Work,#280,360
303,7,LY437,Animation,#169,316
304,8,LY447,Fashion with Promotion,#266,347
305,9,LY457,Graphic and Digital Design,#171,296
375,28,SG231,Fine Art,#248,454

In [123]:
# Extracting courses where not everyone with those points were offered places
df2019_l76_random = df2019_l76[df2019_l76['EOS'].str[-1] == '*']

In [124]:
df2019_l76_random

     index Course Code        Course Title   EOS  Mid
224     33       TR801      Dental Nursing  379*  430
322     26       LY847  Veterinary Nursing  347*  378

In [125]:
# Extracting courses where all qualified applicants earned places
df2019_l76_aqa = df2019_l76[df2019_l76['EOS'].str.match("AQA", na=False)]

In [126]:
df2019_l76_aqa

,index,Course Code,Course Title,EOS,Mid
8,18,AL651,Music and Instrument Technology,AQA,296
9,19,AL660,Culinary Arts,AQA,216
10,20,AL661,Bar Supervision,AQA,216
11,21,AL663,Business (Sport and Recreation),AQA,270
67,27,PC404,Applied Social Studies - Professional Social Care,AQA,245
105,13,DS701,Business,AQA,NaN
109,18,DB528,Applied Social Care,AQA,307
114,23,DB572,Business in Accounting,AQA,403
116,25,DB574,Business in Information Technology,AQA,367
162,20,GC411,Business (Dublin),AQA,349
227,37,DK710,Business and Management,AQA,346
231,41,DK730,Building Surveying,AQA,293
238,48,DK752,Event Management,AQA,326
293,51,GB001,Business,AQA,358
300,4,LY336,"Bar and Restaurant Supervision at Killybegs, C...",AQA,146
301,5,LY406,Photography,AQA,260
365,18,SG101,Business,AQA,338
367,20,SG105,Business in Office Administration,AQA,215
370,23,SG134,Applied Sport with Business,AQA,236
382,35,SG303,Mechanical Engineering,AQA,318

In [127]:
# Add new column with EOS point numbers removing non-digit characters
df2019_l76 = df2019_l76.assign(EOS_Points=df2019_l76['EOS'].str.replace(r'\D', '', regex=True))

While the regex seems to work without issue with the other dataframes, and works for most of this dataframe, in this instance the final 6 entries did not have their points added to the new Points column, and instead these values were left NaN

In [128]:
# View the 2019 l7/6 dataframe
df2019_l76

,index,Course Code,Course Title,EOS,Mid,EOS_Points
0,10,AL600,Software Design,205,306,205
1,11,AL601,Computer Engineering,196,272,196
2,12,AL602,Mechanical Engineering,258,424,258
3,13,AL604,Civil Engineering,252,360,252
4,14,AL630,Pharmacy Technician,306,366,306
...,...,...,...,...,...,...
456,1,WD188,Applied Health Care,206,339,NaN
457,2,WD205,Molecular Biology with Biopharmaceutical Science,208,441,NaN
458,3,WD206,Electronic Engineering,191,322,NaN
459,4,WD207,Mechanical Engineering,179,330,NaN
460,5,WD208,Manufacturing Engineering,195,330,NaN

In [129]:
# Replace the NaN values with the values from the EOS column
df2019_l76.EOS_Points.fillna(df2019_l76.EOS, inplace=True)
df2019_l76

,index,Course Code,Course Title,EOS,Mid,EOS_Points
0,10,AL600,Software Design,205,306,205
1,11,AL601,Computer Engineering,196,272,196
2,12,AL602,Mechanical Engineering,258,424,258
3,13,AL604,Civil Engineering,252,360,252
4,14,AL630,Pharmacy Technician,306,366,306
...,...,...,...,...,...,...
456,1,WD188,Applied Health Care,206,339,206
457,2,WD205,Molecular Biology with Biopharmaceutical Science,208,441,208
458,3,WD206,Electronic Engineering,191,322,191
459,4,WD207,Mechanical Engineering,179,330,179
460,5,WD208,Manufacturing Engineering,195,330,195

In [130]:
# View the 2019 level 7/6 dataframe
df2019_l76

,index,Course Code,Course Title,EOS,Mid,EOS_Points
0,10,AL600,Software Design,205,306,205
1,11,AL601,Computer Engineering,196,272,196
2,12,AL602,Mechanical Engineering,258,424,258
3,13,AL604,Civil Engineering,252,360,252
4,14,AL630,Pharmacy Technician,306,366,306
...,...,...,...,...,...,...
456,1,WD188,Applied Health Care,206,339,206
457,2,WD205,Molecular Biology with Biopharmaceutical Science,208,441,208
458,3,WD206,Electronic Engineering,191,322,191
459,4,WD207,Mechanical Engineering,179,330,179
460,5,WD208,Manufacturing Engineering,195,330,195

In [131]:
# Create a file path for the pandas data.
path2019_l76 = 'cao-data/2019-points/2019-level-7-and-6-points/cao2019_l76_' + current_time + '.csv'

In [132]:
# Save pandas data frame to disk.
df2019_l76.to_csv(path2019_l76)

## 2018 Level 8 Points

In [133]:
# Request CAO website for 2018 level 8 url
url2018_l8 = 'http://www2.cao.ie/points/lvl8_18.pdf'

In [134]:
# Create a file path for the original data.
path2018_l8_pdf = 'cao-data/2018-points/2018-level-8-points/cao2018_l8_' + current_time + '.pdf'

In [135]:
# Save pdf to disk
urlrq.urlretrieve(url2018_l8, path2018_l8_pdf)

('cao-data/2018-points/2018-level-8-points/cao2018_l8_20211219_162629.pdf',
 <http.client.HTTPMessage at 0x1525db95550>)

In [136]:
# Read pdf into panda using tabula
# Using concat as tabula creates a new dataframe for each page of the pdf
# Takes pandas options to remove header as tabula assigns first row on each new page as the header 
df2018_l8_load = pd.concat(tabula.read_pdf("http://www2.cao.ie/points/lvl8_18.pdf", 
                                      pages = 'all', pandas_options={'header': None}))

In [137]:
df2018_l8_load

        0                                                  1    2    3
0     NaN                                ADMISSION DATA 2018  NaN  NaN
1     NaN                                      End of Season  NaN  NaN
2     NaN                                            Level 8  NaN  NaN
3     NaN  The details  given are for general information...  NaN  NaN
4       *   Not all on this points score were offered places  NaN  NaN
..    ...                                                ...  ...  ...
7   WD197                             The Internet of Things  260  329
8   WD200                                               Arts  220  299
9   WD210                       Software Systems Development  289  327
10  WD211                                 Creative Computing  265  326
11  WD212                    Recreation and Sport Management  288  338

[999 rows x 4 columns]

In [138]:
# Rename the columns to match the 2019 level 8 data
df2018_l8_load.columns = ['Course Code', 'Course Title', 'EOS', 'Mid']

In [139]:
# Need to filter out the introductory blurb that isn't needed in the dataframe
# Reusing regular expressions to extract rows with the course codes we want
df2018_l8 = df2018_l8_load[df2018_l8_load['Course Code'].str.match(re_course, na=False)]

In [140]:
# Reset index as tabula had a new index for each page of the pdf
df2018_l8 = df2018_l8.reset_index()

In [141]:
df2018_l8

,index,Course Code,Course Title,EOS,Mid
0,10,AL801,Software Design (Game Development or Cloud Com...,295,326
1,11,AL810,Quantity Surveying,300,340
2,12,AL820,Mechanical and Polymer Engineering,299,371
3,13,AL830,General Nursing,418,440
4,14,AL832,Psychiatric Nursing,377,388
...,...,...,...,...,...
898,7,WD197,The Internet of Things,260,329
899,8,WD200,Arts,220,299
900,9,WD210,Software Systems Development,289,327
901,10,WD211,Creative Computing,265,326
902,11,WD212,Recreation and Sport Management,288,338

In [142]:
# Extract rows where points contain a symbol and include them in new df
# All courses with # required Test / Interview / Portfolio / Audition
df2018_l8_portfolio = df2018_l8[df2018_l8['EOS'].str.match("#", na=False)]

In [143]:
df2018_l8_portfolio

,index,Course Code,Course Title,EOS,Mid
20,30,AL861,Animation and Illustration (Portfolio /Intervi...,#789,948
24,36,CW038,Art (Portfolio - Wexford),#700,700
47,8,CW858,Sport Management and Coaching (with options - ...,#700,700
60,25,CR121,Music at CIT Cork School of Music,#628,1016
61,26,CR125,Popular Music: Electric Bass Guitar at CIT Cor...,#836,875
...,...,...,...,...,...
799,8,MH802,"Community and Youth Work (part-time, in service)",#,NaN
800,9,MH803,"Local Studies or Community Studies (part-time,...",#,NaN
818,31,SG244,Fine Art,#446,446
863,24,TL889,Counselling with Addiction (mature applicants ...,#,NaN
871,34,WD027,Music,#262,338

In [144]:
# Extracting courses where not everyone with those points were offered places
df2018_l8_random = df2018_l8[df2018_l8['EOS'].str[-1] == '*']

In [145]:
df2018_l8_random

,index,Course Code,Course Title,EOS,Mid
72,37,CR320,Biomedical Science - Offered jointly by CIT an...,521*,542
146,5,CK705,Speech and Language Therapy,509*,530
149,8,CK710,General Nursing,440*,473
152,11,CK730,Intellectual Disability Nursing,409*,434
154,13,CK791,Medicine (Graduate Entry),#57*,58
414,31,RC001,Medicine - Undergraduate Entry,#730*,731
415,32,RC004,Physiotherapy,532*,543
417,34,RC101,Medicine - Graduate Entry,#58*,61
430,49,TR018,Law and French,566*,589
436,1,TR024,European Studies,532*,555
439,4,TR029,Political Science and Geography,496*,522
441,6,TR032,Engineering,487*,521
442,7,TR033,Computer Science,444*,485
445,10,TR038,Engineering with Management,509*,554
448,13,TR051,Medicine,#731*,741
449,14,TR052,Dental Science,589*,601
450,15,TR053,Physiotherapy,543*,554
451,16,TR054,Occupational Therapy,507*,520
452,17,TR055,Radiation Therapy,509*,531
455,20,TR061,Chemical Sciences,498*,531
458,23,TR072,Pharmacy,555*,578
460,25,TR081,"Business, Economic and Social Studies (BESS)",511*,540
461,26,TR082,Computer Science and Business,509*,532
465,30,TR086,Business Studies and German,499*,523
468,33,TR090,Business Studies and Spanish,517*,544
469,34,TR091,General Nursing (Meath and St James`s),408*,440
470,35,TR093,General Nursing (Adelaide School of Nursing),#399*,423
473,38,TR911,Children`s and General Nursing (Integrated),463*,479
474,39,TR913,Midwifery,455*,476
485,52,DN261,Food Science,477*,490
489,2,DN300,Veterinary Medicine - Undergraduate Entry,#555*,577
492,5,DN400,Medicine - Undergraduate Entry,#731*,741
493,6,DN401,Medicine - Graduate Entry,#58*,62
496,9,DN425,Health and Performance Science,487*,501
506,19,DN600,Law,521*,541
507,20,DN610,Business and Law,531*,554
508,21,DN650,Commerce,498*,511
510,23,DN670,Economics and Finance,589*,601
530,45,DK870,General Nursing,380*,399
578,41,GA880,General Nursing - Mayo Campus,399*,420
644,1,GY501,Medicine (five year/six year course),#724*,729
665,24,LY918,Psychiatric Nursing,318*,346
748,7,LM101,Medicine (Graduate Entry),#54*,56
763,22,LM156,Midwifery,430*,462
801,12,AS001,"Education, Home Economics and Biology - with c...",462*,477
805,16,AS110,General Nursing,388*,408
816,29,SG242,Early Childhood Care and Education,272*,316
876,39,WD117,Psychiatric Nursing,378*,393

In [146]:
# Extracting courses where all qualified applicants earned places
df2018_l8_aqa = df2018_l8[df2018_l8['EOS'].str.match("AQA", na=False)]

In [147]:
df2018_l8_aqa

,index,Course Code,Course Title,EOS,Mid
488,1,DN272,"Horticulture, Landscape and Sportsturf Management",AQA,321
504,17,DN530,Humanities,AQA,358
514,27,DN750,Social Policy and Sociology,AQA,359

In [148]:
# Add new column with EOS point numbers removing non-digit characters
df2018_l8 = df2018_l8.assign(EOS_Points=df2018_l8['EOS'].str.replace(r'\D', '', regex=True))

In [149]:
df2018_l8

,index,Course Code,Course Title,EOS,Mid,EOS_Points
0,10,AL801,Software Design (Game Development or Cloud Com...,295,326,295
1,11,AL810,Quantity Surveying,300,340,300
2,12,AL820,Mechanical and Polymer Engineering,299,371,299
3,13,AL830,General Nursing,418,440,418
4,14,AL832,Psychiatric Nursing,377,388,377
...,...,...,...,...,...,...
898,7,WD197,The Internet of Things,260,329,260
899,8,WD200,Arts,220,299,220
900,9,WD210,Software Systems Development,289,327,289
901,10,WD211,Creative Computing,265,326,265
902,11,WD212,Recreation and Sport Management,288,338,288

In [150]:
# Create a file path for the pandas data.
path2018_l8 = 'cao-data/2018-points/2018-level-8-points/cao2018_l8_' + current_time + '.csv'

In [151]:
# Save pandas data frame to disk.
df2018_l8.to_csv(path2018_l8)

## 2018 Level 7/6 Points

In [152]:
# Request CAO website for 2018 level 7 and 6 url
url2018_l76 = 'http://www2.cao.ie/points/lvl76_18.pdf'

In [153]:
# Create a file path for the original data.
path2018_l76_pdf = 'cao-data/2018-points/2018-level-7-and-6-points/cao2018_l76_' + current_time + '.pdf'

In [154]:
# Save pdf to disk
urlrq.urlretrieve(url2018_l76, path2018_l76_pdf)

('cao-data/2018-points/2018-level-7-and-6-points/cao2018_l76_20211219_162629.pdf',
 <http.client.HTTPMessage at 0x1525dc91340>)

In [155]:
# Read pdf into panda using tabula
# Using concat as tabula creates a new dataframe for each page of the pdf
# Takes pandas options to remove header as tabula assigns first row on each new page as the header 
df2018_l76_load = pd.concat(tabula.read_pdf("http://www2.cao.ie/points/lvl76_18.pdf", 
                                      pages = 'all', pandas_options={'header': None}))

In [156]:
# Have a look at the imported data
df2018_l76_load

        0                                                  1    2    3
0     NaN                                ADMISSION DATA 2018  NaN  NaN
1     NaN                                      End of Season  NaN  NaN
2     NaN                                         Level 6, 7  NaN  NaN
3     NaN  The details  given are for general information...  NaN  NaN
4       *   Not all on this points score were offered places  NaN  NaN
..    ...                                                ...  ...  ...
41  WD205   Molecular Biology with Biopharmaceutical Science  217  398
42  WD206                             Electronic Engineering  175  330
43  WD207                             Mechanical Engineering  182  362
44  WD208                          Manufacturing Engineering  180  298
45  WD209                      Building Services Engineering  220  379

[538 rows x 4 columns]

In [157]:
# Rename the columns to match the 2019 level 8 data
df2018_l76_load.columns = ['Course Code', 'Course Title', 'EOS', 'Mid']

In [158]:
# Reusing regular expressions to extract rows with the course codes we want
df2018_l76 = df2018_l76_load[df2018_l76_load['Course Code'].str.match(re_course, na=False)]

In [159]:
# Reset index as tabula had a new index for each page of the pdf
df2018_l76 = df2018_l76.reset_index()

In [160]:
df2018_l76

,index,Course Code,Course Title,EOS,Mid
0,10,AL601,Electronics and Computer Engineering,240,321
1,11,AL602,Mechanical Engineering,201,299
2,12,AL604,Civil Engineering,243,320
3,13,AL630,Pharmacy Technician,306,388
4,14,AL631,Dental Nursing,307,348
...,...,...,...,...,...
466,41,WD205,Molecular Biology with Biopharmaceutical Science,217,398
467,42,WD206,Electronic Engineering,175,330
468,43,WD207,Mechanical Engineering,182,362
469,44,WD208,Manufacturing Engineering,180,298
470,45,WD209,Building Services Engineering,220,379

In [161]:
# Extract rows where points contain a symbol and include them in new df
# All courses with # required Test / Interview / Portfolio / Audition
df2018_l76_portfolio = df2018_l76[df2018_l76['EOS'].str.match("#", na=False)]

In [162]:
df2018_l76_portfolio

,index,Course Code,Course Title,EOS,Mid
26,36,AL763,Graphic Design (Portfolio Required),#783,842
35,47,CW057,Art (Portfolio - Wexford),#700,700
55,16,CW807,Sports Coaching and Business Management - GAA ...,#700,700
56,17,CW817,Sports Coaching and Business Management - Rugb...,#700,700
57,18,CW827,Sports Coaching and Business Management - Socc...,#700,700
150,15,DT598,Visual Merchandising and Display,#517,789
194,13,TA014,Advertising and Marketing Communications,#620,712
222,47,TR802,Dental Hygiene,#424,462
223,48,TR803,Dental Technology,#336,388
242,15,DK767,Community Youth Work,#240,300
309,34,LY437,Animation,#218,346
333,8,LC111,Design in Fashion and Textiles for Product and...,#760,924
367,42,LC515,Digital Animation Production (Portfolio - Clon...,#802,837
368,43,LC516,Game Art and Design Production (Portfolio - Cl...,#767,912
382,7,SG231,Fine Art,#345,561

In [163]:
# Extracting courses where not everyone with those points were offered places
df2018_l76_random = df2018_l76[df2018_l76['EOS'].str[-1] == '*']

In [164]:
df2018_l76_random

     index Course Code    Course Title   EOS  Mid
221     46       TR801  Dental Nursing  357*  434

In [165]:
# Extracting courses where all qualified applicants earned places
df2018_l76_aqa = df2018_l76[df2018_l76['EOS'].str.match("AQA", na=False)]

In [166]:
df2018_l76_aqa

     index Course Code                           Course Title  EOS  Mid
7       17       AL651        Music and Instrument Technology  AQA  308
8       18       AL652                     Business in Equine  AQA  281
9       19       AL660                          Culinary Arts  AQA  208
63      26       PC402                             Humanities  AQA  318
64      27       PC404  Applied Social Studies in Social Care  AQA  227
99      14       DS602               Computing and Multimedia  AQA   92
114     31       DB576                         Film and Media  AQA  298
162     31       GC416                      Business (Dublin)  AQA  198
168     37       GC466        Film and TV Production (Dublin)  AQA  320
169     38       GC470            Photographic Media (Dublin)  AQA  349
187      4       BN021                 Creative Digital Media  AQA  314
228      1       DK651                    Hospitality Studies  AQA  178
374     53       SG105      Business in Office Administration  AQA  177
377      2       SG134            Applied Sport with Business  AQA  252
460     35       WD174                                Tourism  AQA  233

In [167]:
# Add new column with EOS point numbers removing non-digit characters
df2018_l76 = df2018_l76.assign(EOS_Points=df2018_l76['EOS'].str.replace(r'\D', '', regex=True))

In [168]:
df2018_l76

,index,Course Code,Course Title,EOS,Mid,EOS_Points
0,10,AL601,Electronics and Computer Engineering,240,321,240
1,11,AL602,Mechanical Engineering,201,299,201
2,12,AL604,Civil Engineering,243,320,243
3,13,AL630,Pharmacy Technician,306,388,306
4,14,AL631,Dental Nursing,307,348,307
...,...,...,...,...,...,...
466,41,WD205,Molecular Biology with Biopharmaceutical Science,217,398,217
467,42,WD206,Electronic Engineering,175,330,175
468,43,WD207,Mechanical Engineering,182,362,182
469,44,WD208,Manufacturing Engineering,180,298,180
470,45,WD209,Building Services Engineering,220,379,220

In [169]:
# Create a file path for the pandas data.
path2018_l76 = 'cao-data/2018-points/2018-level-7-and-6-points/cao2018_l76_' + current_time + '.csv'

In [170]:
# Save pandas data frame to disk.
df2018_l76.to_csv(path2018_l76)

## Concat and join

## Level 8

The code below originally used the data taken from the old webpage of 2021 points data. However, since the later excel file of 2021 points has additional information and lists more courses, the code below has been altered to get the 2021 data from the excel file.

In [171]:
# Create a df of just the 2021 level 8 Course codes and titles
courses2021_l8 = df2021_xlsx_l8[['Course Code', 'Course Title']]
courses2021_l8

     Course Code                                       Course Title
29         AL801     Software Design for Virtual Reality and Gaming
30         AL802  Software Design in Artificial Intelligence for...
31         AL803  Software Design for Mobile Apps and Connected ...
32         AL805    Computer Engineering for Network Infrastructure
33         AL810                                 Quantity Surveying
...          ...                                                ...
1446       WD211                                 Creative Computing
1447       WD212                    Recreation and Sport Management
1448       WD230           Mechanical and Manufacturing Engineering
1449       WD231                 Early Childhood Care and Education
1450       WD232                       Business Information Systems

[1034 rows x 2 columns]

In [172]:
# Create a df of just the 2020 level 8 Course codes and titles
courses2020_l8 = df2020_l8[['Course Code', 'Course Title']]
courses2020_l8

     Course Code                                       Course Title
0          AC120                             International Business
1          AC137                                       Liberal Arts
2          AD101   First Year Art & Design (Common Entry,portfolio)
3          AD102  Graphic Design and Moving Image Design (portfo...
4          AD103  Textile & Surface Design and Jewellery & Objec...
...          ...                                                ...
1455       WD200                                     Arts (options)
1460       WD210                       Software Systems Development
1461       WD211                                 Creative Computing
1462       WD212                    Recreation and Sport Management
1463       WD230           Mechanical and Manufacturing Engineering

[1027 rows x 2 columns]

In [173]:
# Create a df of just the 2019 level 8 Course codes and titles
courses2019_l8 = df2019_l8[['Course Code', 'Course Title']]
courses2019_l8

0   Course Code                                       Course Title
1         AL801    Software Design with Virtual Reality and Gaming
2         AL802               Software Design with Cloud Computing
3         AL803  Software Design with Mobile Apps and Connected...
4         AL805        Network Management and Cloud Infrastructure
5         AL810                                 Quantity Surveying
..          ...                                                ...
960       WD200                                     Arts (options)
961       WD210                       Software Systems Development
962       WD211                                 Creative Computing
963       WD212                    Recreation and Sport Management
964       WD230           Mechanical and Manufacturing Engineering

[930 rows x 2 columns]

In [174]:
# Create a df of just the 2018 level 8 Course codes and titles
courses2018_l8 = df2018_l8[['Course Code', 'Course Title']]
courses2018_l8

    Course Code                                       Course Title
0         AL801  Software Design (Game Development or Cloud Com...
1         AL810                                 Quantity Surveying
2         AL820                 Mechanical and Polymer Engineering
3         AL830                                    General Nursing
4         AL832                                Psychiatric Nursing
..          ...                                                ...
898       WD197                             The Internet of Things
899       WD200                                               Arts
900       WD210                       Software Systems Development
901       WD211                                 Creative Computing
902       WD212                    Recreation and Sport Management

[903 rows x 2 columns]

In [175]:
# Concat level 8 courses df from 2021-2018 together
allcourses_l8 = pd.concat([courses2021_l8, courses2020_l8, 
                           courses2019_l8, courses2018_l8], 
                          ignore_index=True)
allcourses_l8

0    Course Code                                       Course Title
0          AL801     Software Design for Virtual Reality and Gaming
1          AL802  Software Design in Artificial Intelligence for...
2          AL803  Software Design for Mobile Apps and Connected ...
3          AL805    Computer Engineering for Network Infrastructure
4          AL810                                 Quantity Surveying
...          ...                                                ...
3889       WD197                             The Internet of Things
3890       WD200                                               Arts
3891       WD210                       Software Systems Development
3892       WD211                                 Creative Computing
3893       WD212                    Recreation and Sport Management

[3894 rows x 2 columns]

In [176]:
# Sort all level 8 courses by course code
allcourses_l8.sort_values('Course Code')

0    Course Code                              Course Title
175        AC120                    International Business
1034       AC120                    International Business
2229       AC120                    International Business
3146       AC120                    International Business
1035       AC137                              Liberal Arts
...          ...                                       ...
1031       WD230  Mechanical and Manufacturing Engineering
2990       WD230  Mechanical and Manufacturing Engineering
2060       WD230  Mechanical and Manufacturing Engineering
1032       WD231        Early Childhood Care and Education
1033       WD232              Business Information Systems

[3894 rows x 2 columns]

In [177]:
# Finds all extra copies of duplicated rows.
allcourses_l8[allcourses_l8.duplicated()]

0    Course Code                                       Course Title
1034       AC120                             International Business
1035       AC137                                       Liberal Arts
1037       AD102  Graphic Design and Moving Image Design (portfo...
1040       AD204                               Fine Art (portfolio)
1041       AD211                         Fashion Design (portfolio)
...          ...                                                ...
3887       WD194                                      Culinary Arts
3888       WD195  Architectural and Building Information Modelli...
3891       WD210                       Software Systems Development
3892       WD211                                 Creative Computing
3893       WD212                    Recreation and Sport Management

[2306 rows x 2 columns]

In [178]:
# Returns a copy of the data frame with duplciates removed - based only on code.
allcourses_l8.drop_duplicates(subset=['Course Code'], 
                              inplace=True, ignore_index=True)
allcourses_l8

0    Course Code                                       Course Title
0          AL801     Software Design for Virtual Reality and Gaming
1          AL802  Software Design in Artificial Intelligence for...
2          AL803  Software Design for Mobile Apps and Connected ...
3          AL805    Computer Engineering for Network Infrastructure
4          AL810                                 Quantity Surveying
...          ...                                                ...
1256       SG345                               Architectural Design
1257       TL805                    Business Information Management
1258       TL820                      Travel and Tourism Management
1259       WD168                              Entertainment Systems
1260       WD197                             The Internet of Things

[1261 rows x 2 columns]

### Join Level 8 points

In [179]:
# Set the index to the Course Code column.
df2021_xlsx_l8.set_index('Course Code', inplace=True)
df2021_xlsx_l8

,CATEGORY (ISCED Description),Course Title,pointsR1,R1 Random,pointsR2,R2 Random,EOS Points,EOS Random,EOS Midpoints,Course Level,HEI,Test/Interview,AVP,v
Course Code,,,,,,,,,,,,,,
AL801,Information and Communication Technologies (ICTs),Software Design for Virtual Reality and Gaming,300,NaN,NaN,NaN,300,NaN,359,8,Athlone Institute of Technology,NaN,NaN,NaN
AL802,Information and Communication Technologies (ICTs),Software Design in Artificial Intelligence for...,313,NaN,NaN,NaN,313,NaN,381,8,Athlone Institute of Technology,NaN,NaN,NaN
AL803,Information and Communication Technologies (ICTs),Software Design for Mobile Apps and Connected ...,350,NaN,NaN,NaN,350,NaN,398,8,Athlone Institute of Technology,NaN,NaN,NaN
AL805,Information and Communication Technologies (ICTs),Computer Engineering for Network Infrastructure,321,NaN,NaN,NaN,321,NaN,381,8,Athlone Institute of Technology,NaN,NaN,NaN
AL810,Architecture and construction,Quantity Surveying,328,NaN,NaN,NaN,328,NaN,377,8,Athlone Institute of Technology,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
WD211,Information and Communication Technologies (ICTs),Creative Computing,270,NaN,NaN,NaN,270,NaN,392,8,Waterford Institute of Technology,NaN,NaN,NaN
WD212,Personal services,Recreation and Sport Management,262,NaN,NaN,NaN,262,NaN,304,8,Waterford Institute of Technology,NaN,NaN,NaN
WD230,Engineering and engineering trades,Mechanical and Manufacturing Engineering,230,NaN,230,NaN,230,NaN,361,8,Waterford Institute of Technology,NaN,avp,NaN
WD231,Welfare,Early Childhood Care and Education,266,NaN,NaN,NaN,266,NaN,366,8,Waterford Institute of Technology,NaN,NaN,NaN
WD232,Business and administration,Business Information Systems,261,NaN,261,NaN,261,NaN,329,8,Waterford Institute of Technology,NaN,avp,NaN

In [180]:
# Set the index to the Course Code column.
allcourses_l8.set_index('Course Code', inplace=True)

In [181]:
# Join 2021 Level 8 points to all courses df
allcourses_l8 = allcourses_l8.join(df2021_xlsx_l8[['pointsR1', 
                                              'pointsR2', 'EOS Points',
                                             'EOS Midpoints']])

In [182]:
# Rename Columns
allcourses_l8.columns = ['Course Title', 'points_r1_2021', 
                         'points_r2_2021', 'EOS 2021', 'EOS Mid 2021']
allcourses_l8

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021
Course Code,,,,,
AL801,Software Design for Virtual Reality and Gaming,300,NaN,300,359
AL802,Software Design in Artificial Intelligence for...,313,NaN,313,381
AL803,Software Design for Mobile Apps and Connected ...,350,NaN,350,398
AL805,Computer Engineering for Network Infrastructure,321,NaN,321,381
AL810,Quantity Surveying,328,NaN,328,377
...,...,...,...,...,...
SG345,Architectural Design,NaN,NaN,NaN,NaN
TL805,Business Information Management,NaN,NaN,NaN,NaN
TL820,Travel and Tourism Management,NaN,NaN,NaN,NaN
WD168,Entertainment Systems,NaN,NaN,NaN,NaN
WD197,The Internet of Things,NaN,NaN,NaN,NaN

In [183]:
# Extract level 8 points from 2020 dataframe
df2020_l8_points = df2020_l8[['Course Code', 'pointsR1', 
                              'pointsR2', 'EOS', 'EOS Mid-point']]
df2020_l8_points.columns = ['Course Code', 'points_r1_2020', 
                            'points_r2_2020', 'EOS 2020', 'EOS Mid 2020']
df2020_l8_points

     Course Code points_r1_2020 points_r2_2020  EOS 2020 EOS Mid 2020
0          AC120            209            NaN       209          280
1          AC137            252            NaN       252          270
2          AD101       #+matric            NaN  #+matric     #+matric
3          AD102       #+matric            NaN  #+matric     #+matric
4          AD103       #+matric            NaN  #+matric     #+matric
...          ...            ...            ...       ...          ...
1455       WD200            AQA            AQA       AQA          336
1460       WD210            279            NaN       279          337
1461       WD211            271            NaN       271          318
1462       WD212            270            NaN       270          349
1463       WD230            253            NaN       253          369

[1027 rows x 5 columns]

In [184]:
# Set the index to the Course Code column.
df2020_l8_points.set_index('Course Code', inplace=True)
df2020_l8_points

            points_r1_2020 points_r2_2020  EOS 2020 EOS Mid 2020
Course Code
AC120                  209            NaN       209          280
AC137                  252            NaN       252          270
AD101             #+matric            NaN  #+matric     #+matric
AD102             #+matric            NaN  #+matric     #+matric
AD103             #+matric            NaN  #+matric     #+matric
...                    ...            ...       ...          ...
WD200                  AQA            AQA       AQA          336
WD210                  279            NaN       279          337
WD211                  271            NaN       271          318
WD212                  270            NaN       270          349
WD230                  253            NaN       253          369

[1027 rows x 4 columns]

In [185]:
# Join 2020 level 8 points to allcourses.
allcourses_l8 = allcourses_l8.join(df2020_l8_points)
allcourses_l8

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021,points_r1_2020,points_r2_2020,EOS 2020,EOS Mid 2020
Course Code,,,,,,,,,
AL801,Software Design for Virtual Reality and Gaming,300,NaN,300,359,303,NaN,303,367
AL802,Software Design in Artificial Intelligence for...,313,NaN,313,381,332,NaN,332,382
AL803,Software Design for Mobile Apps and Connected ...,350,NaN,350,398,337,NaN,337,360
AL805,Computer Engineering for Network Infrastructure,321,NaN,321,381,333,NaN,333,360
AL810,Quantity Surveying,328,NaN,328,377,319,NaN,326,352
...,...,...,...,...,...,...,...,...,...
SG345,Architectural Design,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL805,Business Information Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL820,Travel and Tourism Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD168,Entertainment Systems,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD197,The Internet of Things,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [186]:
# Extract level 8 points from 2019 dataframe
df2019_l8_points = df2019_l8[['Course Code', 'EOS_Points', 'Mid_Points']]
df2019_l8_points.columns = ['Course Code', 'EOS 2019', 'EOS Mid 2019']
df2019_l8_points

    Course Code EOS 2019 EOS Mid 2019
1         AL801      304          328
2         AL802      301          306
3         AL803      309          337
4         AL805      329          442
5         AL810      307          349
..          ...      ...          ...
960       WD200      221          296
961       WD210      271          329
962       WD211      275          322
963       WD212      274          311
964       WD230      273          348

[930 rows x 3 columns]

In [187]:
# Set the index to the Course Code column.
df2019_l8_points.set_index('Course Code', inplace=True)
df2019_l8_points

            EOS 2019 EOS Mid 2019
Course Code
AL801            304          328
AL802            301          306
AL803            309          337
AL805            329          442
AL810            307          349
...              ...          ...
WD200            221          296
WD210            271          329
WD211            275          322
WD212            274          311
WD230            273          348

[930 rows x 2 columns]

In [188]:
# Join 2019 level 8 points to allcourses.
allcourses_l8 = allcourses_l8.join(df2019_l8_points)
allcourses_l8

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021,points_r1_2020,points_r2_2020,EOS 2020,EOS Mid 2020,EOS 2019,EOS Mid 2019
Course Code,,,,,,,,,,,
AL801,Software Design for Virtual Reality and Gaming,300,NaN,300,359,303,NaN,303,367,304,328
AL802,Software Design in Artificial Intelligence for...,313,NaN,313,381,332,NaN,332,382,301,306
AL803,Software Design for Mobile Apps and Connected ...,350,NaN,350,398,337,NaN,337,360,309,337
AL805,Computer Engineering for Network Infrastructure,321,NaN,321,381,333,NaN,333,360,329,442
AL810,Quantity Surveying,328,NaN,328,377,319,NaN,326,352,307,349
...,...,...,...,...,...,...,...,...,...,...,...
SG345,Architectural Design,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL805,Business Information Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL820,Travel and Tourism Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD168,Entertainment Systems,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD197,The Internet of Things,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [189]:
# Extract level 8 points from 2018 dataframe
df2018_l8_points = df2018_l8[['Course Code', 'EOS_Points','Mid']]
df2018_l8_points.columns = ['Course Code', 'EOS 2018', 'EOS Mid 2018']
df2018_l8_points

    Course Code EOS 2018 EOS Mid 2018
0         AL801      295          326
1         AL810      300          340
2         AL820      299          371
3         AL830      418          440
4         AL832      377          388
..          ...      ...          ...
898       WD197      260          329
899       WD200      220          299
900       WD210      289          327
901       WD211      265          326
902       WD212      288          338

[903 rows x 3 columns]

In [190]:
# Set the index to the Course Code column.
df2018_l8_points.set_index('Course Code', inplace=True)
df2018_l8_points

            EOS 2018 EOS Mid 2018
Course Code
AL801            295          326
AL810            300          340
AL820            299          371
AL830            418          440
AL832            377          388
...              ...          ...
WD197            260          329
WD200            220          299
WD210            289          327
WD211            265          326
WD212            288          338

[903 rows x 2 columns]

In [191]:
# Join 2018 level 8 points to allcourses.
allcourses_l8 = allcourses_l8.join(df2018_l8_points)
allcourses_l8

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021,points_r1_2020,points_r2_2020,EOS 2020,EOS Mid 2020,EOS 2019,EOS Mid 2019,EOS 2018,EOS Mid 2018
Course Code,,,,,,,,,,,,,
AL801,Software Design for Virtual Reality and Gaming,300,NaN,300,359,303,NaN,303,367,304,328,295,326
AL802,Software Design in Artificial Intelligence for...,313,NaN,313,381,332,NaN,332,382,301,306,NaN,NaN
AL803,Software Design for Mobile Apps and Connected ...,350,NaN,350,398,337,NaN,337,360,309,337,NaN,NaN
AL805,Computer Engineering for Network Infrastructure,321,NaN,321,381,333,NaN,333,360,329,442,NaN,NaN
AL810,Quantity Surveying,328,NaN,328,377,319,NaN,326,352,307,349,300,340
...,...,...,...,...,...,...,...,...,...,...,...,...,...
SG345,Architectural Design,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,261,307
TL805,Business Information Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL820,Travel and Tourism Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD168,Entertainment Systems,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,251,351
WD197,The Internet of Things,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,260,329

In [192]:
# Remove remaining '#+matric' values from points columns
allcourses_l8 = allcourses_l8.replace('\#\+matric',np.NaN, regex=True)

In [193]:
# Remove remaining hashtags from points columns 
allcourses_l8 = allcourses_l8.replace('#','', regex=True)

In [194]:
# Add NaN values to blank cells
allcourses_l8 = allcourses_l8.replace('',np.NaN, regex=True)

In [195]:
# Replace remaining AQA cells with NaN
allcourses_l8 = allcourses_l8.replace('AQA',np.NaN, regex=True)

In [196]:
allcourses_l8

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021,points_r1_2020,points_r2_2020,EOS 2020,EOS Mid 2020,EOS 2019,EOS Mid 2019,EOS 2018,EOS Mid 2018
Course Code,,,,,,,,,,,,,
AL801,Software Design for Virtual Reality and Gaming,300,NaN,300.0,359.0,303,NaN,303,367.0,304,328,295,326
AL802,Software Design in Artificial Intelligence for...,313,NaN,313.0,381.0,332,NaN,332,382.0,301,306,NaN,NaN
AL803,Software Design for Mobile Apps and Connected ...,350,NaN,350.0,398.0,337,NaN,337,360.0,309,337,NaN,NaN
AL805,Computer Engineering for Network Infrastructure,321,NaN,321.0,381.0,333,NaN,333,360.0,329,442,NaN,NaN
AL810,Quantity Surveying,328,NaN,328.0,377.0,319,NaN,326,352.0,307,349,300,340
...,...,...,...,...,...,...,...,...,...,...,...,...,...
SG345,Architectural Design,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,261,307
TL805,Business Information Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL820,Travel and Tourism Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD168,Entertainment Systems,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,251,351
WD197,The Internet of Things,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,260,329

In [197]:
# convert points columns to floats
colsl8 = allcourses_l8.columns[1:]
allcourses_l8[colsl8] = allcourses_l8[colsl8].apply(pd.to_numeric)

In [198]:
# Check column types
allcourses_l8.dtypes

Course Title       object
points_r1_2021    float64
points_r2_2021    float64
EOS 2021          float64
EOS Mid 2021      float64
points_r1_2020    float64
points_r2_2020    float64
EOS 2020          float64
EOS Mid 2020      float64
EOS 2019          float64
EOS Mid 2019      float64
EOS 2018          float64
EOS Mid 2018      float64
dtype: object

In [199]:
# View all Level 8 dataframe
allcourses_l8

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021,points_r1_2020,points_r2_2020,EOS 2020,EOS Mid 2020,EOS 2019,EOS Mid 2019,EOS 2018,EOS Mid 2018
Course Code,,,,,,,,,,,,,
AL801,Software Design for Virtual Reality and Gaming,300.0,NaN,300.0,359.0,303.0,NaN,303.0,367.0,304.0,328.0,295.0,326.0
AL802,Software Design in Artificial Intelligence for...,313.0,NaN,313.0,381.0,332.0,NaN,332.0,382.0,301.0,306.0,NaN,NaN
AL803,Software Design for Mobile Apps and Connected ...,350.0,NaN,350.0,398.0,337.0,NaN,337.0,360.0,309.0,337.0,NaN,NaN
AL805,Computer Engineering for Network Infrastructure,321.0,NaN,321.0,381.0,333.0,NaN,333.0,360.0,329.0,442.0,NaN,NaN
AL810,Quantity Surveying,328.0,NaN,328.0,377.0,319.0,NaN,326.0,352.0,307.0,349.0,300.0,340.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
SG345,Architectural Design,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,261.0,307.0
TL805,Business Information Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL820,Travel and Tourism Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD168,Entertainment Systems,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,251.0,351.0
WD197,The Internet of Things,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,260.0,329.0

In [200]:
# Create a file path for the all courses pandas data.
pathallcourses_l8 = 'cao-data/all-courses-points/all-courses-level-8-points/allcourses_l8_' + current_time + '.csv'

In [201]:
# Save pandas data frame to disk.
allcourses_l8.to_csv(pathallcourses_l8)

## Concat Level 7/6

In [202]:
# Create a df of just the 2021 level 7/6 Course codes and titles
courses2021_l76 = df2021_xlsx_l76[['Course Code', 'Course Title']]
courses2021_l76

     Course Code                                      Course Title
0          AL605                   Music and Instrument Technology
1          AL630                               Pharmacy Technician
2          AL631                                    Dental Nursing
3          AL632                                   Applied Science
4          AL650                                          Business
...          ...                                               ...
1434       WD188                               Applied Health Care
1441       WD205  Molecular Biology with Biopharmaceutical Science
1442       WD206                            Electronic Engineering
1443       WD207                            Mechanical Engineering
1444       WD208                         Manufacturing Engineering

[417 rows x 2 columns]

In [203]:
# Create a df of just the 2020 level 7/6 Course codes and titles
courses2020_l76 = df2020_l76[['Course Code', 'Course Title']]
courses2020_l76

     Course Code                                      Course Title
12         AL600                                   Software Design
13         AL601                              Computer Engineering
14         AL602                            Mechanical Engineering
15         AL604                                 Civil Engineering
16         AL605                   Music and Instrument Technology
...          ...                                               ...
1449       WD188                               Applied Health Care
1456       WD205  Molecular Biology with Biopharmaceutical Science
1457       WD206                            Electronic Engineering
1458       WD207                            Mechanical Engineering
1459       WD208                         Manufacturing Engineering

[437 rows x 2 columns]

In [204]:
# Create a df of just the 2019 level 7/6 Course codes and titles
courses2019_l76 = df2019_l76[['Course Code', 'Course Title']]
courses2019_l76

    Course Code                                      Course Title
0         AL600                                   Software Design
1         AL601                              Computer Engineering
2         AL602                            Mechanical Engineering
3         AL604                                 Civil Engineering
4         AL630                               Pharmacy Technician
..          ...                                               ...
456       WD188                               Applied Health Care
457       WD205  Molecular Biology with Biopharmaceutical Science
458       WD206                            Electronic Engineering
459       WD207                            Mechanical Engineering
460       WD208                         Manufacturing Engineering

[461 rows x 2 columns]

In [205]:
# Create a df of just the 2018 level 7/6 Course codes and titles
courses2018_l76 = df2018_l76[['Course Code', 'Course Title']]
courses2018_l76

    Course Code                                      Course Title
0         AL601              Electronics and Computer Engineering
1         AL602                            Mechanical Engineering
2         AL604                                 Civil Engineering
3         AL630                               Pharmacy Technician
4         AL631                                    Dental Nursing
..          ...                                               ...
466       WD205  Molecular Biology with Biopharmaceutical Science
467       WD206                            Electronic Engineering
468       WD207                            Mechanical Engineering
469       WD208                         Manufacturing Engineering
470       WD209                     Building Services Engineering

[471 rows x 2 columns]

In [206]:
# Concat level 7/6 courses df from 2021-2018 together
allcourses_l76 = pd.concat([courses2021_l76, courses2020_l76, 
                            courses2019_l76, courses2018_l76], 
                           ignore_index=True)
allcourses_l76

     Course Code                                      Course Title
0          AL605                   Music and Instrument Technology
1          AL630                               Pharmacy Technician
2          AL631                                    Dental Nursing
3          AL632                                   Applied Science
4          AL650                                          Business
...          ...                                               ...
1781       WD205  Molecular Biology with Biopharmaceutical Science
1782       WD206                            Electronic Engineering
1783       WD207                            Mechanical Engineering
1784       WD208                         Manufacturing Engineering
1785       WD209                     Building Services Engineering

[1786 rows x 2 columns]

In [207]:
# Sort all level 7/6 courses by course code
allcourses_l76.sort_values('Course Code')

     Course Code                          Course Title
417        AL600                       Software Design
854        AL600                       Software Design
855        AL601                  Computer Engineering
418        AL601                  Computer Engineering
1315       AL601  Electronics and Computer Engineering
...          ...                                   ...
853        WD208             Manufacturing Engineering
1784       WD208             Manufacturing Engineering
416        WD208             Manufacturing Engineering
1314       WD208             Manufacturing Engineering
1785       WD209         Building Services Engineering

[1786 rows x 2 columns]

In [208]:
# Finds all extra copies of duplicated rows.
allcourses_l76[allcourses_l76.duplicated()]

     Course Code                                      Course Title
421        AL605                   Music and Instrument Technology
422        AL630                               Pharmacy Technician
423        AL631                                    Dental Nursing
424        AL632                                   Applied Science
425        AL650                                          Business
...          ...                                               ...
1780       WD188                               Applied Health Care
1781       WD205  Molecular Biology with Biopharmaceutical Science
1782       WD206                            Electronic Engineering
1783       WD207                            Mechanical Engineering
1784       WD208                         Manufacturing Engineering

[1030 rows x 2 columns]

In [209]:
# Returns a copy of the data frame with duplciates removed - based only on code.
allcourses_l76.drop_duplicates(subset=['Course Code'], 
                              inplace=True, ignore_index=True)
allcourses_l76

    Course Code                     Course Title
0         AL605  Music and Instrument Technology
1         AL630              Pharmacy Technician
2         AL631                   Dental Nursing
3         AL632                  Applied Science
4         AL650                         Business
..          ...                              ...
608       TL621                 Hotel Operations
609       TL622       Travel and Tourism Studies
610       TL720    Travel and Tourism Management
611       WD040    Building Services Engineering
612       WD209    Building Services Engineering

[613 rows x 2 columns]

### Join Level 7/6 Points

In [210]:
# Set the index to the Course Code column.
df2021_xlsx_l76.set_index('Course Code', inplace=True)
df2021_xlsx_l76

,CATEGORY (ISCED Description),Course Title,pointsR1,R1 Random,pointsR2,R2 Random,EOS Points,EOS Random,EOS Midpoints,Course Level,HEI,Test/Interview,AVP,v
Course Code,,,,,,,,,,,,,,
AL605,Engineering and engineering trades,Music and Instrument Technology,211,NaN,NaN,NaN,211,NaN,319,6,Athlone Institute of Technology,NaN,NaN,NaN
AL630,Health,Pharmacy Technician,308,NaN,NaN,NaN,308,NaN,409,6,Athlone Institute of Technology,NaN,NaN,NaN
AL631,Health,Dental Nursing,311,NaN,NaN,NaN,311,NaN,400,6,Athlone Institute of Technology,NaN,NaN,NaN
AL632,Biological and related sciences,Applied Science,297,NaN,NaN,NaN,297,NaN,454,6,Athlone Institute of Technology,NaN,NaN,NaN
AL650,Business and administration,Business,AQA,NaN,AQA,NaN,AQA,NaN,351,6,Athlone Institute of Technology,NaN,avp,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
WD188,Health,Applied Health Care,220,NaN,NaN,NaN,220,NaN,402,7,Waterford Institute of Technology,NaN,NaN,NaN
WD205,Biological and related sciences,Molecular Biology with Biopharmaceutical Science,AQA,NaN,262,NaN,AQA,NaN,434,7,Waterford Institute of Technology,NaN,avp,NaN
WD206,Engineering and engineering trades,Electronic Engineering,180,NaN,NaN,NaN,180,NaN,367,7,Waterford Institute of Technology,NaN,NaN,NaN
WD207,Engineering and engineering trades,Mechanical Engineering,172,NaN,NaN,NaN,172,NaN,356,7,Waterford Institute of Technology,NaN,NaN,NaN
WD208,Engineering and engineering trades,Manufacturing Engineering,317,NaN,NaN,NaN,317,NaN,368,7,Waterford Institute of Technology,NaN,NaN,NaN

In [211]:
# Set the index to the Course Code column.
allcourses_l76.set_index('Course Code', inplace=True)

In [212]:
# Join 2021 Level 7/6 points to all courses df
allcourses_l76 = allcourses_l76.join(df2021_xlsx_l76[['pointsR1', 
                                              'pointsR2', 'EOS Points',
                                             'EOS Midpoints']])

In [213]:
# Rename Columns
allcourses_l76.columns = ['Course Title', 'points_r1_2021', 
                         'points_r2_2021', 'EOS 2021', 'EOS Mid 2021']
allcourses_l76

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021
Course Code,,,,,
AL605,Music and Instrument Technology,211,NaN,211,319
AL630,Pharmacy Technician,308,NaN,308,409
AL631,Dental Nursing,311,NaN,311,400
AL632,Applied Science,297,NaN,297,454
AL650,Business,AQA,AQA,AQA,351
...,...,...,...,...,...
TL621,Hotel Operations,NaN,NaN,NaN,NaN
TL622,Travel and Tourism Studies,NaN,NaN,NaN,NaN
TL720,Travel and Tourism Management,NaN,NaN,NaN,NaN
WD040,Building Services Engineering,NaN,NaN,NaN,NaN
WD209,Building Services Engineering,NaN,NaN,NaN,NaN

In [214]:
# Extract level 7/6 points from 2020 dataframe
df2020_l76_points = df2020_l76[['Course Code', 'pointsR1', 
                              'pointsR2', 'EOS', 'EOS Mid-point']]
df2020_l76_points.columns = ['Course Code', 'points_r1_2020', 
                            'points_r2_2020', 'EOS 2020', 'EOS Mid 2020']
df2020_l76_points

     Course Code points_r1_2020 points_r2_2020 EOS 2020 EOS Mid 2020
12         AL600            AQA            NaN      104          279
13         AL601            AQA            219      112          192
14         AL602            AQA            NaN      260          424
15         AL604            AQA            AQA      AQA          244
16         AL605            AQA            AQA      154          306
...          ...            ...            ...      ...          ...
1449       WD188            201            NaN      201          349
1456       WD205            228            NaN      228          446
1457       WD206            179            NaN      179          373
1458       WD207            198            NaN      198          365
1459       WD208            188            NaN      188          339

[437 rows x 5 columns]

In [215]:
# Set the index to the Course Code column.
df2020_l76_points.set_index('Course Code', inplace=True)
df2020_l76_points

            points_r1_2020 points_r2_2020 EOS 2020 EOS Mid 2020
Course Code
AL600                  AQA            NaN      104          279
AL601                  AQA            219      112          192
AL602                  AQA            NaN      260          424
AL604                  AQA            AQA      AQA          244
AL605                  AQA            AQA      154          306
...                    ...            ...      ...          ...
WD188                  201            NaN      201          349
WD205                  228            NaN      228          446
WD206                  179            NaN      179          373
WD207                  198            NaN      198          365
WD208                  188            NaN      188          339

[437 rows x 4 columns]

In [216]:
# Join 2020 level 7/6 points to allcourses.
allcourses_l76 = allcourses_l76.join(df2020_l76_points)
allcourses_l76

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021,points_r1_2020,points_r2_2020,EOS 2020,EOS Mid 2020
Course Code,,,,,,,,,
AL605,Music and Instrument Technology,211,NaN,211,319,AQA,AQA,154,306
AL630,Pharmacy Technician,308,NaN,308,409,295,NaN,295,379
AL631,Dental Nursing,311,NaN,311,400,300,298,298,388
AL632,Applied Science,297,NaN,297,454,234,NaN,234,434
AL650,Business,AQA,AQA,AQA,351,207,NaN,207,326
...,...,...,...,...,...,...,...,...,...
TL621,Hotel Operations,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL622,Travel and Tourism Studies,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL720,Travel and Tourism Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD040,Building Services Engineering,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD209,Building Services Engineering,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [217]:
# Extract level 7/6 points from 2019 dataframe
df2019_l76_points = df2019_l76[['Course Code', 'EOS_Points','Mid']]
df2019_l76_points.columns = ['Course Code', 'EOS 2019', 'EOS Mid 2019']
df2019_l76_points

    Course Code EOS 2019 EOS Mid 2019
0         AL600      205          306
1         AL601      196          272
2         AL602      258          424
3         AL604      252          360
4         AL630      306          366
..          ...      ...          ...
456       WD188      206          339
457       WD205      208          441
458       WD206      191          322
459       WD207      179          330
460       WD208      195          330

[461 rows x 3 columns]

In [218]:
# Set the index to the Course Code column.
df2019_l76_points.set_index('Course Code', inplace=True)
df2019_l76_points

            EOS 2019 EOS Mid 2019
Course Code
AL600            205          306
AL601            196          272
AL602            258          424
AL604            252          360
AL630            306          366
...              ...          ...
WD188            206          339
WD205            208          441
WD206            191          322
WD207            179          330
WD208            195          330

[461 rows x 2 columns]

In [219]:
# Join 2019 level 7/6 points to allcourses.
allcourses_l76 = allcourses_l76.join(df2019_l76_points)
allcourses_l76

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021,points_r1_2020,points_r2_2020,EOS 2020,EOS Mid 2020,EOS 2019,EOS Mid 2019
Course Code,,,,,,,,,,,
AL605,Music and Instrument Technology,211,NaN,211,319,AQA,AQA,154,306,NaN,NaN
AL630,Pharmacy Technician,308,NaN,308,409,295,NaN,295,379,306,366
AL631,Dental Nursing,311,NaN,311,400,300,298,298,388,326,379
AL632,Applied Science,297,NaN,297,454,234,NaN,234,434,243,372
AL650,Business,AQA,AQA,AQA,351,207,NaN,207,326,210,317
...,...,...,...,...,...,...,...,...,...,...,...
TL621,Hotel Operations,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL622,Travel and Tourism Studies,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
TL720,Travel and Tourism Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD040,Building Services Engineering,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
WD209,Building Services Engineering,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [220]:
# Extract level 7/6 points from 2018 dataframe
df2018_l76_points = df2018_l76[['Course Code', 'EOS_Points','Mid']]
df2018_l76_points.columns = ['Course Code', 'EOS 2018', 'EOS Mid 2018']
df2018_l76_points

    Course Code EOS 2018 EOS Mid 2018
0         AL601      240          321
1         AL602      201          299
2         AL604      243          320
3         AL630      306          388
4         AL631      307          348
..          ...      ...          ...
466       WD205      217          398
467       WD206      175          330
468       WD207      182          362
469       WD208      180          298
470       WD209      220          379

[471 rows x 3 columns]

In [221]:
# Set the index to the Course Code column.
df2018_l76_points.set_index('Course Code', inplace=True)
df2018_l76_points

            EOS 2018 EOS Mid 2018
Course Code
AL601            240          321
AL602            201          299
AL604            243          320
AL630            306          388
AL631            307          348
...              ...          ...
WD205            217          398
WD206            175          330
WD207            182          362
WD208            180          298
WD209            220          379

[471 rows x 2 columns]

In [222]:
# Join 2018 level 7/6 points to allcourses.
allcourses_l76 = allcourses_l76.join(df2018_l76_points)
allcourses_l76

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021,points_r1_2020,points_r2_2020,EOS 2020,EOS Mid 2020,EOS 2019,EOS Mid 2019,EOS 2018,EOS Mid 2018
Course Code,,,,,,,,,,,,,
AL605,Music and Instrument Technology,211,NaN,211,319,AQA,AQA,154,306,NaN,NaN,NaN,NaN
AL630,Pharmacy Technician,308,NaN,308,409,295,NaN,295,379,306,366,306,388
AL631,Dental Nursing,311,NaN,311,400,300,298,298,388,326,379,307,348
AL632,Applied Science,297,NaN,297,454,234,NaN,234,434,243,372,216,444
AL650,Business,AQA,AQA,AQA,351,207,NaN,207,326,210,317,200,357
...,...,...,...,...,...,...,...,...,...,...,...,...,...
TL621,Hotel Operations,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,100,214
TL622,Travel and Tourism Studies,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,254,280
TL720,Travel and Tourism Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,261,359
WD040,Building Services Engineering,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,223,318
WD209,Building Services Engineering,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,220,379

In [223]:
# Remove remaining '#+matric' values from points columns
allcourses_l76 = allcourses_l76.replace('\#\+matric',np.NaN, regex=True)

In [224]:
# Remove remaining hashtags from points columns 
allcourses_l76 = allcourses_l76.replace('#','', regex=True)

In [225]:
# Add NaN values to blank cells
allcourses_l76 = allcourses_l76.replace('',np.NaN, regex=True)

In [226]:
# Replace remaining AQA cells with NaN
allcourses_l76 = allcourses_l76.replace('AQA',np.NaN, regex=True)

In [227]:
allcourses_l76

,Course Title,points_r1_2021,points_r2_2021,EOS 2021,EOS Mid 2021,points_r1_2020,points_r2_2020,EOS 2020,EOS Mid 2020,EOS 2019,EOS Mid 2019,EOS 2018,EOS Mid 2018
Course Code,,,,,,,,,,,,,
AL605,Music and Instrument Technology,211,NaN,211.0,319.0,NaN,NaN,154,306.0,NaN,NaN,NaN,NaN
AL630,Pharmacy Technician,308,NaN,308.0,409.0,295,NaN,295,379.0,306,366,306,388
AL631,Dental Nursing,311,NaN,311.0,400.0,300,298,298,388.0,326,379,307,348
AL632,Applied Science,297,NaN,297.0,454.0,234,NaN,234,434.0,243,372,216,444
AL650,Business,NaN,NaN,NaN,351.0,207,NaN,207,326.0,210,317,200,357
...,...,...,...,...,...,...,...,...,...,...,...,...,...
TL621,Hotel Operations,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,100,214
TL622,Travel and Tourism Studies,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,254,280
TL720,Travel and Tourism Management,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,261,359
WD040,Building Services Engineering,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,223,318
WD209,Building Services Engineering,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,220,379

In [228]:
# convert points columns to floats
colsl76 = allcourses_l76.columns[1:]
allcourses_l76[colsl76] = allcourses_l76[colsl76].apply(pd.to_numeric)

In [229]:
# Check column types
allcourses_l76.dtypes

Course Title       object
points_r1_2021    float64
points_r2_2021    float64
EOS 2021          float64
EOS Mid 2021      float64
points_r1_2020    float64
points_r2_2020    float64
EOS 2020          float64
EOS Mid 2020      float64
EOS 2019          float64
EOS Mid 2019      float64
EOS 2018          float64
EOS Mid 2018      float64
dtype: object

In [230]:
# Create a file path for the all courses pandas data.
pathallcourses_l76 = 'cao-data/all-courses-points/all-courses-level-7-and-6-points/allcourses_l76_' + current_time + '.csv'

In [231]:
# Save pandas data frame to disk.
allcourses_l76.to_csv(pathallcourses_l76)

## Analysis

For initial analyses, the mid values from each year would appear to be the best place to start. It contains values for every year a course took place, and gives an idea as to the average points attained by the people wh accepted places for a particular course. As such, this would give the best overview of the points over the years

### Level 8 Analysis

First step is to create a new dataframe which contains only the mid columns from each year for level 8 data.

In [232]:
# New dataframe containing level 8 mid columns
allcourses_l8_mid = pd.DataFrame(index=allcourses_l8.index.copy())
allcourses_l8_mid = allcourses_l8[["Course Title", "EOS Mid 2021", "EOS Mid 2020", 
                                   "EOS Mid 2019", "EOS Mid 2018"]]

In [233]:
allcourses_l8_mid

,Course Title,EOS Mid 2021,EOS Mid 2020,EOS Mid 2019,EOS Mid 2018
Course Code,,,,,
AL801,Software Design for Virtual Reality and Gaming,359.0,367.0,328.0,326.0
AL802,Software Design in Artificial Intelligence for...,381.0,382.0,306.0,NaN
AL803,Software Design for Mobile Apps and Connected ...,398.0,360.0,337.0,NaN
AL805,Computer Engineering for Network Infrastructure,381.0,360.0,442.0,NaN
AL810,Quantity Surveying,377.0,352.0,349.0,340.0
...,...,...,...,...,...
SG345,Architectural Design,NaN,NaN,NaN,307.0
TL805,Business Information Management,NaN,NaN,NaN,NaN
TL820,Travel and Tourism Management,NaN,NaN,NaN,NaN
WD168,Entertainment Systems,NaN,NaN,NaN,351.0
WD197,The Internet of Things,NaN,NaN,NaN,329.0

In [234]:
allcourses_l8_mid.describe()

       EOS Mid 2021  EOS Mid 2020  EOS Mid 2019  EOS Mid 2018
count   1014.000000    988.000000    915.000000    875.000000
mean     465.928994    448.198381    426.414208    422.273143
std      132.284315    129.237735    133.142255    127.488725
min        0.000000     57.000000     57.000000     56.000000
25%      379.000000    362.000000    339.000000    338.000000
50%      455.000000    426.500000    397.000000    392.000000
75%      541.000000    510.000000    477.500000    476.000000
max     1141.000000   1088.000000   1073.000000   1045.000000

### Level 7 and 6 Analysis

The same strategy will be used with level 7 and 6 data, by first looking at the mid values from each year.

In [235]:
allcourses_l76_mid = pd.DataFrame(index=allcourses_l76.index.copy())
allcourses_l76_mid = allcourses_l76[["Course Title", "EOS Mid 2021", "EOS Mid 2020", 
                                   "EOS Mid 2019", "EOS Mid 2018"]]

In [236]:
allcourses_l76_mid

,Course Title,EOS Mid 2021,EOS Mid 2020,EOS Mid 2019,EOS Mid 2018
Course Code,,,,,
AL605,Music and Instrument Technology,319.0,306.0,NaN,NaN
AL630,Pharmacy Technician,409.0,379.0,366.0,388.0
AL631,Dental Nursing,400.0,388.0,379.0,348.0
AL632,Applied Science,454.0,434.0,372.0,444.0
AL650,Business,351.0,326.0,317.0,357.0
...,...,...,...,...,...
TL621,Hotel Operations,NaN,NaN,NaN,214.0
TL622,Travel and Tourism Studies,NaN,NaN,NaN,280.0
TL720,Travel and Tourism Management,NaN,NaN,NaN,359.0
WD040,Building Services Engineering,NaN,NaN,NaN,318.0
WD209,Building Services Engineering,NaN,NaN,NaN,379.0

In [237]:
allcourses_l76_mid.describe()

       EOS Mid 2021  EOS Mid 2020  EOS Mid 2019  EOS Mid 2018
count    417.000000    434.000000    453.000000    460.000000
mean     396.223022    377.048387    345.830022    340.893478
std       94.631830     75.252370     77.590483     91.262863
min        0.000000    192.000000    146.000000     92.000000
25%      357.000000    337.000000    300.000000    295.500000
50%      391.000000    368.000000    337.000000    330.000000
75%      431.000000    403.000000    377.000000    369.000000
max      900.000000    892.000000    873.000000    924.000000

## References